[{
	"url": "e30yl0hwaYg",
	"title": "Non Binary Priest Says God Loves Variety",
	"description": "Non Binary Priest Says God Loves Variety by Melonie Mac Go Boom 2 days ago 46 minutes 15,902 views", "quote": "Im not even Christian but I just love how you respect your faith and religion. your videos are excellent melonie! thank you for making them! Im your biggest french fan! also Im learning english a lot when Im watching your videos!"
}, {
	"url": "l5DgM9yU2nU",
	"title": "Why Hogwarts Legacy Continues to Succeed Despite Cancel Mob",
	"description": "Why Hogwarts Legacy Continues to Succeed Despite Cancel Mob by Melonie Mac Go Boom 4 days ago 18 minutes 41,363 views", "quote": "its fun to own the wokies sometimes  lol I just recently discovered your channel and Im really enjoying your videos.    you go boom girl."
}, {
	"url": "IknI7tpYBZY",
	"title": "Ubisoft is Cancelling More Games - Something Has Got to Change",
	"description": "Ubisoft is Cancelling More Games - Something Has Got to Change by Melonie Mac Go Boom 4 days ago 15 minutes 37,966 views", "quote": "dang  melonie... you ve been cracking out fire video after fire video lately! and you ve been dropping the truths that people need to hear!"
}, {
	"url": "oUwB54SSIsc",
	"title": "Hate Campaign BACKFIRES - Hogwarts Legacy",
	"description": "Hate Campaign BACKFIRES - Hogwarts Legacy by Melonie Mac Go Boom 7 days ago 13 minutes, 7 seconds 62,759 views", "quote": "so glad melonie went on her own.... this channel is the best! she would never have been able to be true about this shiznit before!"
}, {
	"url": "nM_als-QGP0",
	"title": "Woman Fired from Limited Run Games for Being a Conservative Christian",
	"description": "Woman Fired from Limited Run Games for Being a Conservative Christian by Melonie Mac Go Boom 9 days ago 13 minutes, 4 seconds 48,990 views", "quote": "I d take one melonie  over ten thousand jlaws.  just sayin .   keep rockin  it  mel.  youre a beauty in every possible way."
}, {
	"url": "JrMwZV57Myc",
	"title": "Silent Hill 2 Remake Less Scary for Modern Audiences",
	"description": "Silent Hill 2 Remake Less Scary for Modern Audiences by Melonie Mac Go Boom 10 days ago 12 minutes, 16 seconds 25,726 views", "quote": "yeah! you said it melonie! studios  make new stories and franchises! same goes with movies! make new stuff for modern audiences and if they wanna remake the legendary "
}, {
	"url": "EBnS4_LoFVM",
	"title": "Wokies REEE over Hogwarts Legacy Preorders",
	"description": "Wokies REEE over Hogwarts Legacy Preorders by Melonie Mac Go Boom 10 days ago 22 minutes 78,468 views", "quote": "dont listen the hate melonie. keep being you. its what draws me to your content. you help people."
}, {
	"url": "I6Yqg4ISHS0",
	"title": "So... the Joker is Pregnant Now",
	"description": "So... the Joker is Pregnant Now by Melonie Mac Go Boom 12 days ago 11 minutes, 46 seconds 28,603 views", "quote": "pregnant as a man with a mud baby.....what the actual f  - great video melonie  keep going boom"
}, {
	"url": "EA9U7v6AYPE",
	"title": "Reacting to Liam Hemsworth as Geralt in The Witcher Season 4 on Netflix",
	"description": "Reacting to Liam Hemsworth as Geralt in The Witcher Season 4 on Netflix by Melonie Mac Go Boom 12 days ago 15 minutes 26,102 views", "quote": "you do some of the funniest faces for your thumbnails melonie I swear to God"
}, {
	"url": "6WvGmDDIz0A",
	"title": "UPDATE: Jeremy Renner Airlifted to Hospital in Critical Condition",
	"description": "UPDATE: Jeremy Renner Airlifted to Hospital in Critical Condition by Melonie Mac Go Boom 13 days ago 12 minutes, 34 seconds 19,487 views", "quote": ""
}, {
	"url": "7_gpJ1fayso",
	"title": "The Witcher Blood Origin Episode Review",
	"description": "The Witcher Blood Origin Episode Review by Melonie Mac Go Boom 2 weeks ago 19 minutes 29,613 views", "quote": "youre the kindest and most respectful of the creators. thank you and a very happy new year  melonie."
}, {
	"url": "3Ae90mTyVPw",
	"title": "So I have a Stalker",
	"description": "So I have a Stalker by Melonie Mac Go Boom 2 weeks ago 22 minutes 98,587 views", "quote": "Im perfectly happy with my wife of 34 years. I enjoy watching melonie s videos because unlike most of the other online critics she isn t approaching her subject matter with anger and hatred  she seems genuinely amused at the insanity of the woke culture but keeps herself upbeat."
}, {
	"url": "iMFI4TDLhsk",
	"title": "James Gunn Denies DCEU Complete Recast But I Think He Is Lying",
	"description": "James Gunn Denies DCEU Complete Recast But I Think He Is Lying by Melonie Mac Go Boom 3 weeks ago 15 minutes 24,485 views", "quote": "thats why I subscribed to your channel in the first place    keep doing the wonderful work youre doing  melonie! merry Christmas to you  miss mac! God bless you all the way! go boom!"
}, {
	"url": "ydM0V7TiMmo",
	"title": "Hollywood Hates Henry Cavill - They Dont Deserve Superman",
	"description": "Hollywood Hates Henry Cavill - They Dont Deserve Superman by Melonie Mac Go Boom 1 month ago 12 minutes, 24 seconds 34,435 views", "quote": "loved the video. ya you hit the right points about cavill. he s a fan of a lot of good material. no one should ever apologize for being a masculine man lol."
}, {
	"url": "VWs3iQHbEE8",
	"title": "Tomb Raider Teams With Amazon Games to Publish Lara Crofts Next Game",
	"description": "Tomb Raider Teams With Amazon Games to Publish Lara Crofts Next Game by Melonie Mac Go Boom 1 month ago 19 minutes 32,620 views", "quote": "I just wanted to pop in and say in regards to tuesdays video  just how proud I am of you for that video. I would argue that was one of the most necessary things you ve ever produced. it has such an important message given the times were living in."
}, {
	"url": "D7HNu6By1Rw",
	"title": "Woke Ideology is Satanic",
	"description": "Woke Ideology is Satanic by Melonie Mac Go Boom 1 month ago 33 minutes 40,405 views", "quote": "you put my thoughts into perfect words. Im not religious and Im fully antI woke globalism  but I respect melonie s argument and faith as well!"
}, {
	"url": "2xBU296IOSc",
	"title": "Netflix to Ruin My Hero Academia in Live Action",
	"description": "Netflix to Ruin My Hero Academia in Live Action by Melonie Mac Go Boom 1 month ago 12 minutes, 23 seconds 15,787 views", "quote": "this!! thanks for saying such a timeless piece of truth  melonie!"
}, {
	"url": "LcIndxO4bZI",
	"title": "BREAKING: Jennifer Lawrence Invented Women",
	"description": "BREAKING: Jennifer Lawrence Invented Women by Melonie Mac Go Boom 1 month ago 12 minutes, 35 seconds 50,618 views", "quote": "melonie mac taking no prisoners today"
}, {
	"url": "G52WmbfsqUY",
	"title": "New Lara Croft Shm3xh Doll Just Dropped - Tomb Raider",
	"description": "New Lara Croft Shm3xh Doll Just Dropped - Tomb Raider by Melonie Mac Go Boom 1 month ago 11 minutes, 21 seconds 131,516 views", "quote": "melonies reactions are the best. especially when she kept accidentally going to the wrong screen."
}, {
	"url": "Ce7IWkxKCa4",
	"title": "Dead Space Remake is Uglifying Their Women",
	"description": "Dead Space Remake is Uglifying Their Women by Melonie Mac Go Boom 1 month ago 12 minutes, 52 seconds 68,687 views", "quote": "if I can look that good at her age  Ill know Ive  made it ."
}, {
	"url": "KIhq_Eh5g-A",
	"title": "Marvel Making BIG Changes to Save Phases 5 and 6 of the MCU",
	"description": "Marvel Making BIG Changes to Save Phases 5 and 6 of the MCU by Melonie Mac Go Boom 1 month ago 13 minutes, 46 seconds 21,356 views", "quote": "thanks! melonie youre bringing some terrific energy on a dreary monday.   the spider-man 90 s cartoon is next level awesomeness. "
}, {
	"url": "TORhCaaM6yQ",
	"title": "Is Princess Peach Woke in the Super Mario Bros Movie?",
	"description": "Is Princess Peach Woke in the Super Mario Bros Movie? by Melonie Mac Go Boom 1 month ago 11 minutes 41,714 views", "quote": "this is exactly how I feel. peach can be a  boss   sure  but not in such cliched  lazy  stereotypically feminist ways. rather  she s courageous  decisive  protective  honorable  i.e.  the qualities you d hope to find among royalty."
}, {
	"url": "BwSDlNndU5w",
	"title": "DC is Rebuilding - canthey just give the fans what we want already?",
	"description": "DC is Rebuilding - canthey just give the fans what we want already? by Melonie Mac Go Boom 1 month ago 12 minutes, 59 seconds 17,695 views", "quote": "youre not alone in this fight  melonie. God, I and many others  are with you."
}, {
	"url": "77FVvdoWgbw",
	"title": "Simu Liu Slams Tarantino Because He is Irrelevant and Jealous",
	"description": "Simu Liu Slams Tarantino Because He is Irrelevant and Jealous by Melonie Mac Go Boom 1 month ago 19 minutes 36,879 views", "quote": "melonie pronouncing names is one of my favorite things."
}, {
	"url": "VbYvWwLP2Cw",
	"title": "Marvel Doesnt Like Hiring Comic Book Fans",
	"description": "Marvel Doesnt Like Hiring Comic Book Fans by Melonie Mac Go Boom 1 month ago 12 minutes, 27 seconds 25,090 views", "quote": "Ive been saying this for a long time about media not specifically marvel but in general. thanks melonie keep making more videos keep fighting and again happy birthday."
}, {
	"url": "aLMv0bb7_SY",
	"title": "Oh No Mario is White in the Super Mario Bros Movie!",
	"description": "Oh No Mario is White in the Super Mario Bros Movie! by Melonie Mac Go Boom 1 month ago 12 minutes, 8 seconds 29,909 views", "quote": "melonie! youre doing a great job!  keep it up and God bless!"
}, {
	"url": "_cxTgqnBCFA",
	"title": "Identity Obsession is Tanking the MCU: She Hulk, Ironheart, and More",
	"description": "Identity Obsession is Tanking the MCU: She Hulk, Ironheart, and More by Melonie Mac Go Boom 1 month ago 20 minutes 37,076 views", "quote": "you hit the nail on the head melonie. I really enjoy your videos. I always look forward to them. take care of yourself."
}, {
	"url": "ZabvcDTvVXQ",
	"title": "Actors Still Bullying Tolkien Fans Into Supporting Amazons Lord of the Rings: Rings of Power",
	"description": "Actors Still Bullying Tolkien Fans Into Supporting Amazons Lord of the Rings: Rings of Power by Melonie Mac Go Boom 1 month ago 12 minutes, 47 seconds 30,770 views", "quote": "awesome video again.  Im reminded by a george carlin bit where he said   thats how the ruling class acts in any society  keep the lower classes fighting among themselves while they keep going to the bank.  keep up the great work melonie!"
}, {
	"url": "RLscmQnpfeg",
	"title": "Female Pirates of the Caribbean Cancelled According to Margot Robbie",
	"description": "Female Pirates of the Caribbean Cancelled According to Margot Robbie by Melonie Mac Go Boom 2 months ago 17 minutes 28,266 views", "quote": "love hearing your thoughts on this melonie mac. you brought the boom and love it. also glad this pos all female pirates of the caribbean movie was cancelled. awesome news the timeline is healing boys!"
}, {
	"url": "RYFrikrUEII",
	"title": "Indiana Jones Replaced by a Woman? Test Screening Possible Endings Suggest",
	"description": "Indiana Jones Replaced by a Woman? Test Screening Possible Endings Suggest by Melonie Mac Go Boom 2 months ago 12 minutes, 59 seconds 30,282 views", "quote": "to be fair  I d watch the hell out of melonie mac as indiana jones"
}, {
	"url": "RXykcwN7Y-w",
	"title": "Marvels Blade Movie Being Rewritten? Woke Underworld Clone?",
	"description": "Marvels Blade Movie Being Rewritten? Woke Underworld Clone? by Melonie Mac Go Boom 2 months ago 13 minutes, 3 seconds 75,573 views", "quote": "we definitely dont seem to be gettng top quality shows and movies like we used too. Im right there with ya melonie. I usually love these types of movies. and I loved underworld. this is very interesting. great video melonie. enjoy your day. give your dad and brothers a hug from us. and take care melonie."
}, {
	"url": "yDgUnyy_23Q",
	"title": "Fable Reboot is Going Woke As Per Xbox",
	"description": "Fable Reboot is Going Woke As Per Xbox by Melonie Mac Go Boom 2 months ago 11 minutes, 22 seconds 58,301 views", "quote": "thank you for your daily boldness and courage for speaking out against these things  melonie! be of good courage  and he shall strengthen your heart  all ye that hope in the Lord."
}, {
	"url": "VD19e4Vwb_U",
	"title": "Rings of Power Gets a Reboot? Amazon is Panicking!",
	"description": "Rings of Power Gets a Reboot? Amazon is Panicking! by Melonie Mac Go Boom 2 months ago 16 minutes 85,664 views", "quote": "I love and am passionate about myself because I can no longer sit and watch them butcher all of it.. it was the last straw for me. keep it up melonie! love listening to you talking about these things!"
}, {
	"url": "SXv-ol22jMw",
	"title": "Final Fantasy XVI SLAMMED for Whiteness",
	"description": "Final Fantasy XVI SLAMMED for Whiteness by Melonie Mac Go Boom 2 months ago 12 minutes, 20 seconds 39,189 views", "quote": "excellent commentary  melonie. I particularly liked the nod to yoko taro at the end. boom!"
}, {
	"url": "QFNdMbXJLHY",
	"title": "The Witcher Fans DEMAND Henry Cavill Return",
	"description": "The Witcher Fans DEMAND Henry Cavill Return by Melonie Mac Go Boom 2 months ago 12 minutes 30,602 views", "quote": "too many subjects to talk about is a great problem to have melonie. I love hearing your unfiltered opinions. have a great day."
}, {
	"url": "SHFsX36Y1uA",
	"title": "Emma DArcey Makes Men of the Year List - House of the Dragon Star",
	"description": "Emma DArcey Makes Men of the Year List - House of the Dragon Star by Melonie Mac Go Boom 2 months ago 12 minutes, 13 seconds 49,504 views", "quote": "what is the world coming to... I have no words lol thank God for you melonie for having common sense with the rest of us who do!"
}, {
	"url": "t6dN1IfOlmw",
	"title": "Live Action Hercules Inspired by Tiktok? Disney Have Lost their Minds",
	"description": "Live Action Hercules Inspired by Tiktok? Disney Have Lost their Minds by Melonie Mac Go Boom 2 months ago 12 minutes, 48 seconds 26,816 views", "quote": ""
}, {
	"url": "y61EX10jvLo",
	"title": "G4s Frosk Attacks Henry Cavill",
	"description": "G4s Frosk Attacks Henry Cavill by Melonie Mac Go Boom 2 months ago 13 minutes, 36 seconds 91,805 views", "quote": ""
}, {
	"url": "S52N-xr_p_Y",
	"title": "Marvel Ruined Namor in Black Panther: Wakanda Forever",
	"description": "Marvel Ruined Namor in Black Panther: Wakanda Forever by Melonie Mac Go Boom 2 months ago 11 minutes, 23 seconds 115,208 views", "quote": ""
}, {
	"url": "MlisggXZiHs",
	"title": "Kotaku Blames Gamergate for PelosI Attack",
	"description": "Kotaku Blames Gamergate for PelosI Attack by Melonie Mac Go Boom 2 months ago 12 minutes, 48 seconds 17,091 views", "quote": ""
}, {
	"url": "rvkQixmNYlo",
	"title": "She Hulk Somehow Got Nominated for an Award",
	"description": "She Hulk Somehow Got Nominated for an Award by Melonie Mac Go Boom 2 months ago 11 minutes, 8 seconds 53,144 views", "quote": ""
}, {
	"url": "6Mu_D6ZYASE",
	"title": "Henry Cavill Quits The Witcher",
	"description": "Henry Cavill Quits The Witcher by Melonie Mac Go Boom 2 months ago 12 minutes, 14 seconds 100,293 views", "quote": ""
}, {
	"url": "J7On4DLGL3E",
	"title": "Peeps Mad That Bayonetta Likes Dudes",
	"description": "Peeps Mad That Bayonetta Likes Dudes by Melonie Mac Go Boom 2 months ago 13 minutes, 31 seconds 70,162 views", "quote": ""
}, {
	"url": "5tKlAKmr7t0",
	"title": "Gamers are Bigots According to Study",
	"description": "Gamers are Bigots According to Study by Melonie Mac Go Boom 2 months ago 14 minutes, 49 seconds 55,470 views", "quote": ""
}, {
	"url": "ki-AZeEPN7w",
	"title": "Amazon Desperate to Fix Rings of Power",
	"description": "Amazon Desperate to Fix Rings of Power by Melonie Mac Go Boom 2 months ago 11 minutes, 1 second 58,007 views", "quote": ""
}, {
	"url": "ECU6WZXwzD4",
	"title": "Netflix The Witcher Producer says Writers Hate the Books and Games",
	"description": "Netflix The Witcher Producer says Writers Hate the Books and Games by Melonie Mac Go Boom 2 months ago 10 minutes, 4 seconds 59,014 views", "quote": ""
}, {
	"url": "oNMm6gj3NOo",
	"title": "Welp, Bayonetta Voice Actress Lied",
	"description": "Welp, Bayonetta Voice Actress Lied by Melonie Mac Go Boom 2 months ago 11 minutes, 34 seconds 63,825 views", "quote": ""
}, {
	"url": "ecIP1BdlAgg",
	"title": "The Updated for a Modern Audience Curse",
	"description": "The Updated for a Modern Audience Curse by Melonie Mac Go Boom 2 months ago 15 minutes 185,424 views", "quote": ""
}, {
	"url": "zBn2idm7XLk",
	"title": "She Hulk Creators say Show Was Bad on Purpose",
	"description": "She Hulk Creators say Show Was Bad on Purpose by Melonie Mac Go Boom 2 months ago 12 minutes, 26 seconds 119,464 views", "quote": ""
}, {
	"url": "dWhZ396M4Kg",
	"title": "Kotaku Hating on White Men Again - Ethan Winters and James Sunderland",
	"description": "Kotaku Hating on White Men Again - Ethan Winters and James Sunderland by Melonie Mac Go Boom 2 months ago 13 minutes, 16 seconds 62,727 views", "quote": ""
}, {
	"url": "EtEirDkYKq8",
	"title": "No More Flash for Ezra Miller",
	"description": "No More Flash for Ezra Miller by Melonie Mac Go Boom 2 months ago 11 minutes, 44 seconds 63,122 views", "quote": ""
}, {
	"url": "hcx4go3aulc",
	"title": "Ex G4TV Employee Snaps at Me",
	"description": "Ex G4TV Employee Snaps at Me by Melonie Mac Go Boom 2 months ago 13 minutes, 6 seconds 78,304 views", "quote": ""
}, {
	"url": "lE_WPljwi_k",
	"title": "She Hulk Director on Sex Positivity for Kids",
	"description": "She Hulk Director on Sex Positivity for Kids by Melonie Mac Go Boom 2 months ago 12 minutes, 53 seconds 70,119 views", "quote": ""
}, {
	"url": "xyvxgntfr8s",
	"title": "G4TV is Gone Forever",
	"description": "G4TV is Gone Forever by Melonie Mac Go Boom 2 months ago 12 minutes, 9 seconds 65,694 views", "quote": ""
}, {
	"url": "iGxbUt3lgOM",
	"title": "So the Rings of Power Finale Sucked",
	"description": "So the Rings of Power Finale Sucked by Melonie Mac Go Boom 3 months ago 15 minutes 52,519 views", "quote": ""
}, {
	"url": "DIrWUzLfgfk",
	"title": "She Hulk Season Finale Was Dreadful",
	"description": "She Hulk Season Finale Was Dreadful by Melonie Mac Go Boom 3 months ago 15 minutes 128,540 views", "quote": ""
}, {
	"url": "W4K0vnsyVic",
	"title": "Chainsaw Man Episode 1 Anime Review",
	"description": "Chainsaw Man Episode 1 Anime Review by Melonie Mac Go Boom 3 months ago 12 minutes, 31 seconds 14,842 views", "quote": ""
}, {
	"url": "8uKSPczUkak",
	"title": "HBO Emasculates Fred in Velma Scooby Doo Spinoff",
	"description": "HBO Emasculates Fred in Velma Scooby Doo Spinoff by Melonie Mac Go Boom 3 months ago 13 minutes, 38 seconds 178,955 views", "quote": ""
}, {
	"url": "GSS2MwfbbSM",
	"title": "Gay Superman is Cancelled",
	"description": "Gay Superman is Cancelled by Melonie Mac Go Boom 3 months ago 13 minutes, 11 seconds 48,054 views", "quote": ""
}, {
	"url": "e1AspAT5jCk",
	"title": "HBO Fixed Daphne in Velma Scooby Doo Spinoff",
	"description": "HBO Fixed Daphne in Velma Scooby Doo Spinoff by Melonie Mac Go Boom 3 months ago 12 minutes, 54 seconds 248,486 views", "quote": ""
}, {
	"url": "FPKyEViVgPQ",
	"title": "How is Rings of Power STILL this bad at Episode 7?!",
	"description": "How is Rings of Power STILL this bad at Episode 7?! by Melonie Mac Go Boom 3 months ago 14 minutes, 5 seconds 33,138 views", "quote": ""
}, {
	"url": "J3feH7uR_7k",
	"title": "Was Daredevil Enough to Redeem She Hulk?",
	"description": "Was Daredevil Enough to Redeem She Hulk? by Melonie Mac Go Boom 3 months ago 16 minutes 55,276 views", "quote": ""
}, {
	"url": "GN3q1Zr1Glg",
	"title": "Streaming Shows are Fudging Their Numbers",
	"description": "Streaming Shows are Fudging Their Numbers by Melonie Mac Go Boom 3 months ago 10 minutes, 32 seconds 22,631 views", "quote": ""
}, {
	"url": "iCx2H4u2jLw",
	"title": "Wakanda Forever: Woke Trash or Possibly Good?",
	"description": "Wakanda Forever: Woke Trash or Possibly Good? by Melonie Mac Go Boom 3 months ago 12 minutes, 50 seconds 30,229 views", "quote": ""
}, {
	"url": "XPxwSxtS0hk",
	"title": "She Hulk Actress Doesnt Care that the Show Sucks",
	"description": "She Hulk Actress Doesnt Care that the Show Sucks by Melonie Mac Go Boom 3 months ago 12 minutes, 57 seconds 86,508 views", "quote": ""
}, {
	"url": "QBZsTWjJWL0",
	"title": "Breaking News: Hating on Men Wont Make Them Watch Your Movie",
	"description": "Breaking News: Hating on Men Wont Make Them Watch Your Movie by Melonie Mac Go Boom 3 months ago 15 minutes 173,668 views", "quote": ""
}, {
	"url": "JYImlB-rLe8",
	"title": "Im Good at Playing Women says Non Binary House of the Dragon Actor Emma Darcy",
	"description": "Im Good at Playing Women says Non Binary House of the Dragon Actor Emma Darcy by Melonie Mac Go Boom 3 months ago 25 minutes 85,697 views", "quote": ""
}, {
	"url": "x716OOiXxOk",
	"title": "Rings of Power is a Giant Meme",
	"description": "Rings of Power is a Giant Meme by Melonie Mac Go Boom 3 months ago 15 minutes 52,618 views", "quote": ""
}, {
	"url": "lfZQbyI7SI8",
	"title": "She Hulk is a Bad Example for Women",
	"description": "She Hulk is a Bad Example for Women by Melonie Mac Go Boom 3 months ago 14 minutes, 13 seconds 97,461 views", "quote": ""
}, {
	"url": "LKYr4COTYDQ",
	"title": "Rings of Power Fans are Insecure",
	"description": "Rings of Power Fans are Insecure by Melonie Mac Go Boom 3 months ago 13 minutes, 19 seconds 49,076 views", "quote": ""
}, {
	"url": "c9H_UiRpfAg",
	"title": "Rings of Power Continues to be an Embarrassment",
	"description": "Rings of Power Continues to be an Embarrassment by Melonie Mac Go Boom 3 months ago 15 minutes 71,657 views", "quote": ""
}, {
	"url": "UNmGPIwKazs",
	"title": "She Hulk Fans are Mad at Men As Usual",
	"description": "She Hulk Fans are Mad at Men As Usual by Melonie Mac Go Boom 3 months ago 12 minutes, 38 seconds 233,952 views", "quote": ""
}, {
	"url": "lpYodKJv-J0",
	"title": "The Wussification of James Bond",
	"description": "The Wussification of James Bond by Melonie Mac Go Boom 3 months ago 12 minutes, 11 seconds 30,357 views", "quote": ""
}, {
	"url": "mOJQ1F_oSDo",
	"title": "Splinter Cell is Going Woke",
	"description": "Splinter Cell is Going Woke by Melonie Mac Go Boom 3 months ago 10 minutes, 58 seconds 33,825 views", "quote": ""
}, {
	"url": "Lfw8HL3gfz0",
	"title": "Amazon Scraps Conan Because Men Bad",
	"description": "Amazon Scraps Conan Because Men Bad by Melonie Mac Go Boom 3 months ago 15 minutes 155,116 views", "quote": ""
}, {
	"url": "xtllcx5bOrg",
	"title": "Looks Like G4TV Fired Frosk",
	"description": "Looks Like G4TV Fired Frosk by Melonie Mac Go Boom 3 months ago 11 minutes, 52 seconds 49,862 views", "quote": ""
}, {
	"url": "SqAz_DyPLRo",
	"title": "Should Twitch Ban Gambling Over ItsSliker Scam?",
	"description": "Should Twitch Ban Gambling Over ItsSliker Scam? by Melonie Mac Go Boom 3 months ago 11 minutes, 10 seconds 5,186 views", "quote": ""
}, {
	"url": "eGchnywNqww",
	"title": "Woke Overwatch Fans Are Offended by Kiriko",
	"description": "Woke Overwatch Fans Are Offended by Kiriko by Melonie Mac Go Boom 3 months ago 14 minutes, 7 seconds 54,544 views", "quote": ""
}, {
	"url": "JwjBI1VKfXo",
	"title": "Frosk is Hurting G4s Reputation Again",
	"description": "Frosk is Hurting G4s Reputation Again by Melonie Mac Go Boom 4 months ago 13 minutes, 42 seconds 58,172 views", "quote": ""
}, {
	"url": "EQJz1D1O3IQ",
	"title": "Representation Activism is Narcissism",
	"description": "Representation Activism is Narcissism by Melonie Mac Go Boom 4 months ago 17 minutes 22,333 views", "quote": ""
}, {
	"url": "3tMLZEfEfpk",
	"title": "Brie Larson Goes Karen Again",
	"description": "Brie Larson Goes Karen Again by Melonie Mac Go Boom 4 months ago 17 minutes 50,080 views", "quote": ""
}, {
	"url": "Q_pkvy7C9OM",
	"title": "The She Hulk Hypocrisy Keeps Gettng Worse",
	"description": "The She Hulk Hypocrisy Keeps Gettng Worse by Melonie Mac Go Boom 4 months ago 16 minutes 23,827 views", "quote": ""
}, {
	"url": "PHMraoyXoGE",
	"title": "Bad News Tomb Raider is DOA",
	"description": "Bad News Tomb Raider is DOA by Melonie Mac Go Boom 4 months ago 13 minutes, 17 seconds 19,284 views", "quote": ""
}, {
	"url": "FHJVo8grtcc",
	"title": "Elijah Wood Simps for Rings of Power",
	"description": "Elijah Wood Simps for Rings of Power by Melonie Mac Go Boom 4 months ago 12 minutes, 3 seconds 9,111 views", "quote": ""
}, {
	"url": "PwISZpxCfVQ",
	"title": "Rings of Power Reviews Have Dropped",
	"description": "Rings of Power Reviews Have Dropped by Melonie Mac Go Boom 4 months ago 14 minutes, 25 seconds 16,458 views", "quote": ""
}, {
	"url": "C39jvmKRk4A",
	"title": "Red Sonja Unwokes Itself?",
	"description": "Red Sonja Unwokes Itself? by Melonie Mac Go Boom 4 months ago 10 minutes, 44 seconds 20,544 views", "quote": ""
}, {
	"url": "tadBBGMeXJI",
	"title": "Progressives are Hijacking Christianity",
	"description": "Progressives are Hijacking Christianity by Melonie Mac Go Boom 5 months ago 21 minutes 21,201 views", "quote": ""
}, {
	"url": "HVUaki-wovE",
	"title": "Prey (Predator) Movie Review",
	"description": "Prey (Predator) Movie Review by Melonie Mac Go Boom 5 months ago 14 minutes, 3 seconds 14,609 views", "quote": ""
}, {
	"url": "JZmtWhqszLE",
	"title": "New Tomb Raider Game Alleged Leaks",
	"description": "New Tomb Raider Game Alleged Leaks by Melonie Mac Go Boom 5 months ago 29 minutes 31,164 views", "quote": ""
}, {
	"url": "_4LhcPp9Isw",
	"title": "Theyre admitting it now... another Rings of Power fail",
	"description": "Theyre admitting it now... another Rings of Power fail by Melonie Mac Go Boom 5 months ago 13 minutes, 34 seconds 16,947 views", "quote": "you send a powerful message with each and every one of your videos! Im still not Christian and I love your way of making those messages make sense to the real world. so many people are too wrapped up in their own nonsense to take the time to relate with reality."
}, {
	"url": "yP1i7H1drcE",
	"title": "They Made Lara Croft Ugly on Purpose",
	"description": "They Made Lara Croft Ugly on Purpose by Melonie Mac Go Boom 5 months ago 11 minutes, 32 seconds 21,871 views", "quote": ""
}, {
	"url": "Tp3yDEQkfCw",
	"title": "Rings of Power Fires Consultant for Calling Them Out",
	"description": "Rings of Power Fires Consultant for Calling Them Out by Melonie Mac Go Boom 5 months ago 11 minutes, 48 seconds 8,578 views", "quote": ""
}, {
	"url": "SXjBhfUEb3s",
	"title": "Rippaverse Gives Us Hope Against the Woke Narrative",
	"description": "Rippaverse Gives Us Hope Against the Woke Narrative by Melonie Mac Go Boom 5 months ago 22 minutes 15,164 views", "quote": ""
}, {
	"url": "N1R_g_0I3yA",
	"title": "Tomb Raider Movie Sequel Looks Unalived",
	"description": "Tomb Raider Movie Sequel Looks Unalived by Melonie Mac Go Boom 6 months ago 11 minutes, 23 seconds 13,981 views", "quote": ""
}, {
	"url": "-szeEkVIXT0",
	"title": "Welp She Hulk is Gonna Be M-She-U Trash",
	"description": "Welp She Hulk is Gonna Be M-She-U Trash by Melonie Mac Go Boom 6 months ago 11 minutes, 45 seconds 20,433 views", "quote": ""
}, {
	"url": "XS6S6KoEjjU",
	"title": "Netflix is Ruining Death Note Again",
	"description": "Netflix is Ruining Death Note Again by Melonie Mac Go Boom 6 months ago 4 minutes, 21 seconds 6,852 views", "quote": ""
}, {
	"url": "S7aj3Wz61Tg",
	"title": "Did Crystal Dynamics Sneakily Reveal the Next Lara Croft?",
	"description": "Did Crystal Dynamics Sneakily Reveal the Next Lara Croft? by Melonie Mac Go Boom 6 months ago 11 minutes, 55 seconds 8,189 views", "quote": ""
}, {
	"url": "RUFfElWCr5A",
	"title": "Tomb Raider Needs Another Reboot or it Will Fail",
	"description": "Tomb Raider Needs Another Reboot or it Will Fail by Melonie Mac Go Boom 6 months ago 18 minutes 23,215 views", "quote": ""
}, {
	"url": "pCcIi3hbjFk",
	"title": "Why is Joker 2 a Musical?",
	"description": "Why is Joker 2 a Musical? by Melonie Mac Go Boom 7 months ago 11 minutes, 34 seconds 6,921 views", "quote": ""
}, {
	"url": "wrnZe9GTQZM",
	"title": "Overwatchs Junker Queen is Underwhelming",
	"description": "Overwatchs Junker Queen is Underwhelming by Melonie Mac Go Boom 7 months ago 10 minutes, 6 seconds 9,604 views", "quote": ""
}, {
	"url": "hgMUtqBun9o",
	"title": "Brad Pitt is Suing Angelina Jolie",
	"description": "Brad Pitt is Suing Angelina Jolie by Melonie Mac Go Boom 7 months ago 16 minutes 6,678 views", "quote": ""
}, {
	"url": "8UR7Oyed4ts",
	"title": "Black Adam Trailer Reaction",
	"description": "Black Adam Trailer Reaction by Melonie Mac Go Boom 7 months ago 24 minutes 10,002 views", "quote": ""
}, {
	"url": "OSf_NoFds30",
	"title": "Prey Predator Prequel Trailer Reaction",
	"description": "Prey Predator Prequel Trailer Reaction by Melonie Mac Go Boom 7 months ago 15 minutes 11,005 views", "quote": ""
}, {
	"url": "LJ7AajUOUPc",
	"title": "Amber Heard Completely Cut from Aquaman 2?",
	"description": "Amber Heard Completely Cut from Aquaman 2? by Melonie Mac Go Boom 7 months ago 14 minutes, 28 seconds 5,527 views", "quote": ""
}, {
	"url": "AKdM4Wzy6aE",
	"title": "Did Street Fighter 6 Go Woke?",
	"description": "Did Street Fighter 6 Go Woke? by Melonie Mac Go Boom 7 months ago 21 minutes 11,844 views", "quote": ""
}, {
	"url": "2YOFIL5_1lM",
	"title": "Warrior Galadriel Looks Ridiculous - Rings of Power",
	"description": "Warrior Galadriel Looks Ridiculous - Rings of Power by Melonie Mac Go Boom 7 months ago 22 minutes 10,106 views", "quote": ""
}, {
	"url": "laaWUmxd0b0",
	"title": "Reacting to the Verdict: Johnny Depp vs Amber Heard Trial",
	"description": "Reacting to the Verdict: Johnny Depp vs Amber Heard Trial by Melonie Mac Go Boom 7 months ago 14 minutes, 24 seconds 8,377 views", "quote": ""
}, {
	"url": "3UBnZhDoUdo",
	"title": "Star Wars is Calling Fans Racist Again",
	"description": "Star Wars is Calling Fans Racist Again by Melonie Mac Go Boom 7 months ago 35 minutes 8,914 views", "quote": ""
}, {
	"url": "ueRlTGWyZk0",
	"title": "Veganism is a Scam",
	"description": "Veganism is a Scam by Melonie Mac Go Boom 7 months ago 47 minutes 18,237 views", "quote": ""
}, {
	"url": "jvpnFk42Hr4",
	"title": "Apparently Theres a Social Fat Spectrum Now",
	"description": "Apparently Theres a Social Fat Spectrum Now by Melonie Mac Go Boom 7 months ago 39 minutes 14,387 views", "quote": ""
}, {
	"url": "pIzr0BCJH8M",
	"title": "The Double Standard is Real",
	"description": "The Double Standard is Real by Melonie Mac Go Boom 7 months ago 24 minutes 23,678 views", "quote": ""
}, {
	"url": "HSU94U3If6o",
	"title": "Batwoman Star Says She Will Be the Next Lara Croft",
	"description": "Batwoman Star Says She Will Be the Next Lara Croft by Melonie Mac Go Boom 7 months ago 21 minutes 12,190 views", "quote": ""
}, {
	"url": "WcfYh5suE2M",
	"title": "Halo is Now the Most Butchered Fandom Ever",
	"description": "Halo is Now the Most Butchered Fandom Ever by Melonie Mac Go Boom 7 months ago 21 minutes 7,491 views", "quote": ""
}, {
	"url": "8tV50d-goow",
	"title": "Tomb Raider Remasters Finally Happening?!",
	"description": "Tomb Raider Remasters Finally Happening?! by Melonie Mac Go Boom 7 months ago 16 minutes 8,693 views", "quote": ""
}, {
	"url": "vxx9dPtHl0E",
	"title": "She Hulk Attorney at Law Trailer Reaction",
	"description": "She Hulk Attorney at Law Trailer Reaction by Melonie Mac Go Boom 7 months ago 16 minutes 10,158 views", "quote": ""
}, {
	"url": "Ai7oIVzJuQ8",
	"title": "Amber Heards Mera Role Cut Down by WB",
	"description": "Amber Heards Mera Role Cut Down by WB by Melonie Mac Go Boom 7 months ago 18 minutes 6,625 views", "quote": ""
}, {
	"url": "D6tCF9LnIP0",
	"title": "Q and A Time!",
	"description": "Q and A Time! by Melonie Mac Go Boom 8 months ago 31 minutes 19,892 views", "quote": ""
}, {
	"url": "RrO1CmqdnWs",
	"title": "NY Post Says Trump Encouraged Musk to Buy Twitter",
	"description": "NY Post Says Trump Encouraged Musk to Buy Twitter by Melonie Mac Go Boom 8 months ago 30 minutes 4,124 views", "quote": ""
}, {
	"url": "waJDjAARRJE",
	"title": "The Reboot Tomb Raider Games Did NOT Sell Well",
	"description": "The Reboot Tomb Raider Games Did NOT Sell Well by Melonie Mac Go Boom 8 months ago 27 minutes 9,959 views", "quote": ""
}, {
	"url": "ax1sUKY6Cmk",
	"title": "Florida Cops Open Fire on Pokemon Card Shoplifters",
	"description": "Florida Cops Open Fire on Pokemon Card Shoplifters by Melonie Mac Go Boom 8 months ago 16 minutes 5,339 views", "quote": ""
}, {
	"url": "5HSnu1YDvsw",
	"title": "Idiot Attempts to Rob a Concealed Carry Class",
	"description": "Idiot Attempts to Rob a Concealed Carry Class by Melonie Mac Go Boom 8 months ago 27 minutes 7,482 views", "quote": ""
}, {
	"url": "DIxLiuSiHAg",
	"title": "Square Enix Sells Tomb Raider",
	"description": "Square Enix Sells Tomb Raider by Melonie Mac Go Boom 8 months ago 17 minutes 11,164 views", "quote": ""
}, {
	"url": "k-xahmPQINg",
	"title": "Dead By Daylight Shoehorns Gay Character for Woke Points",
	"description": "Dead By Daylight Shoehorns Gay Character for Woke Points by Melonie Mac Go Boom 8 months ago 18 minutes 7,460 views", "quote": ""
}, {
	"url": "NgSC4mQ8zH0",
	"title": "Woman Marries Cat to Escape Eviction",
	"description": "Woman Marries Cat to Escape Eviction by Melonie Mac Go Boom 8 months ago 24 minutes 5,124 views", "quote": ""
}, {
	"url": "gVSMl_zJwEA",
	"title": "James Gunn Defends Chris Pratt Against Cancel Mob",
	"description": "James Gunn Defends Chris Pratt Against Cancel Mob by Melonie Mac Go Boom 8 months ago 19 minutes 5,318 views", "quote": ""
}, {
	"url": "ftmkeD2G214",
	"title": "Resident Evil 4 VR Censors Sexist Content",
	"description": "Resident Evil 4 VR Censors Sexist Content by Melonie Mac Go Boom 8 months ago 29 minutes 7,166 views", "quote": ""
}, {
	"url": "2ZbcQrv6h4A",
	"title": "Robert Downey Jrs Vegan Diet Aint Working",
	"description": "Robert Downey Jrs Vegan Diet Aint Working by Melonie Mac Go Boom 8 months ago 29 minutes 13,250 views", "quote": ""
}, {
	"url": "DeS0TrbOcUk",
	"title": "Idiots Get STDs from Lizard?",
	"description": "Idiots Get STDs from Lizard? by Melonie Mac Go Boom 8 months ago 18 minutes 8,084 views", "quote": ""
}, {
	"url": "TQOUKL8dbsI",
	"title": "Amber Heard Lies Exposed by Makeup Brand",
	"description": "Amber Heard Lies Exposed by Makeup Brand by Melonie Mac Go Boom 8 months ago 18 minutes 11,001 views", "quote": ""
}, {
	"url": "Z1yEWM6JtsA",
	"title": "Guy Sues Streamer Girl for not Falling in Love with Him",
	"description": "Guy Sues Streamer Girl for not Falling in Love with Him by Melonie Mac Go Boom 8 months ago 17 minutes 12,282 views", "quote": ""
}, {
	"url": "0ceqkDyhJ0A",
	"title": "Uncancellable Abusers in Hollywood",
	"description": "Uncancellable Abusers in Hollywood by Melonie Mac Go Boom 8 months ago 30 minutes 14,216 views", "quote": ""
}, {
	"url": "Bqm8hAFBWMw",
	"title": "GTAV Remaster Removed Alleged Transphobic Content",
	"description": "GTAV Remaster Removed Alleged Transphobic Content by Melonie Mac Go Boom 8 months ago 26 minutes 8,672 views", "quote": ""
}, {
	"url": "Cl4iY4uxJV4",
	"title": "The Woke Mob is Trying to Cancel Chris Pratt Again",
	"description": "The Woke Mob is Trying to Cancel Chris Pratt Again by Melonie Mac Go Boom 8 months ago 27 minutes 12,141 views", "quote": ""
}, {
	"url": "LoAKBQpD8hI",
	"title": "Thor Love and Thunder Trailer Reaction",
	"description": "Thor Love and Thunder Trailer Reaction by Melonie Mac Go Boom 8 months ago 26 minutes 15,018 views", "quote": ""
}, {
	"url": "XsHUsZmSLl4",
	"title": "Pedro Pascal Didnt Study for His Role for Joel in The Last of Us",
	"description": "Pedro Pascal Didnt Study for His Role for Joel in The Last of Us by Melonie Mac Go Boom 9 months ago 22 minutes 6,403 views", "quote": ""
}, {
	"url": "mYK1ZnnnEQ0",
	"title": "Elon Musk Buying Twitter for Free Speech?",
	"description": "Elon Musk Buying Twitter for Free Speech? by Melonie Mac Go Boom 9 months ago 19 minutes 7,698 views", "quote": ""
}, {
	"url": "ImlsxUEbaIk",
	"title": "Activision Blizzard to Hire More Women Plus Political Scandal",
	"description": "Activision Blizzard to Hire More Women Plus Political Scandal by Melonie Mac Go Boom 9 months ago 25 minutes 8,455 views", "quote": ""
}, {
	"url": "G_2EJ08VteA",
	"title": "TMNT Comics Made April ONeil Uglier",
	"description": "TMNT Comics Made April ONeil Uglier by Melonie Mac Go Boom 9 months ago 19 minutes 16,708 views", "quote": ""
}, {
	"url": "SKI-dNM2fbc",
	"title": "Brie Larson Joins Fast & Furious 10",
	"description": "Brie Larson Joins Fast & Furious 10 by Melonie Mac Go Boom 9 months ago 19 minutes 8,539 views", "quote": ""
}, {
	"url": "Y943LTwdgDQ",
	"title": "Chrono Cross Remaster Censorship",
	"description": "Chrono Cross Remaster Censorship by Melonie Mac Go Boom 9 months ago 19 minutes 12,991 views", "quote": ""
}, {
	"url": "O3-fQICf4pQ",
	"title": "Gaming Journos Want Lara Croft to be Lesbian",
	"description": "Gaming Journos Want Lara Croft to be Lesbian by Melonie Mac Go Boom 9 months ago 21 minutes 14,398 views", "quote": ""
}, {
	"url": "HT_vBLHaavs",
	"title": "Based Batman Writer says Rings of Power is an Abomination",
	"description": "Based Batman Writer says Rings of Power is an Abomination by Melonie Mac Go Boom 9 months ago 19 minutes 11,273 views", "quote": ""
}, {
	"url": "A6ytC5C6EkY",
	"title": "New Tomb Raider Game Officially Announced 2022",
	"description": "New Tomb Raider Game Officially Announced 2022 by Melonie Mac Go Boom 9 months ago 29 minutes 26,003 views", "quote": ""
}, {
	"url": "aGfvxFuAlaE",
	"title": "Why Morbius Was So Bad",
	"description": "Why Morbius Was So Bad by Melonie Mac Go Boom 9 months ago 28 minutes 11,260 views", "quote": ""
}, {
	"url": "u2HeVH_YTrQ",
	"title": "White Woman Gaming Journo Hating on White Men Again",
	"description": "White Woman Gaming Journo Hating on White Men Again by Melonie Mac Go Boom 9 months ago 13 minutes, 46 seconds 14,463 views", "quote": ""
}, {
	"url": "aDizTkivE04",
	"title": "LOTR Fansite Dying on the Rings of Power Hill",
	"description": "LOTR Fansite Dying on the Rings of Power Hill by Melonie Mac Go Boom 9 months ago 21 minutes 13,339 views", "quote": ""
}, {
	"url": "dEKJUqdRBxw",
	"title": "Anita Sarkeesian Says Feminism Has Won in Gaming",
	"description": "Anita Sarkeesian Says Feminism Has Won in Gaming by Melonie Mac Go Boom 9 months ago 16 minutes 24,014 views", "quote": ""
}, {
	"url": "heg8rtKOtEc",
	"title": "Ron Perlman Woke Twitter Meltdown",
	"description": "Ron Perlman Woke Twitter Meltdown by Melonie Mac Go Boom 9 months ago 10 minutes, 50 seconds 6,600 views", "quote": ""
}, {
	"url": "O1JRvhCleyQ",
	"title": "She Hulk Supposedly Looks Like Trash",
	"description": "She Hulk Supposedly Looks Like Trash by Melonie Mac Go Boom 9 months ago 14 minutes, 19 seconds 11,529 views", "quote": ""
}, {
	"url": "NtPj-qSD4ac",
	"title": "Will Smith vs Chris Rock Slap Gate - Was it Real?",
	"description": "Will Smith vs Chris Rock Slap Gate - Was it Real? by Melonie Mac Go Boom 9 months ago 14 minutes, 35 seconds 7,391 views", "quote": ""
}, {
	"url": "JeDzUxtXtKo",
	"title": "Game Journos Not Happy with Representation Again in Ghostwire Tokyo Review",
	"description": "Game Journos Not Happy with Representation Again in Ghostwire Tokyo Review by Melonie Mac Go Boom 9 months ago 14 minutes, 59 seconds 9,866 views", "quote": ""
}, {
	"url": "RowpDyy7DXs",
	"title": "Hayley Atwell as Lara Croft, Jujutsu Kaisen, and FnT. Answering Comments",
	"description": "Hayley Atwell as Lara Croft, Jujutsu Kaisen, and FnT. Answering Comments by Melonie Mac Go Boom 9 months ago 19 minutes 10,186 views", "quote": ""
}, {
	"url": "tf3s-WdCJUQ",
	"title": "Nicolas Cage Disses Disney",
	"description": "Nicolas Cage Disses Disney by Melonie Mac Go Boom 9 months ago 16 minutes 9,508 views", "quote": ""
}, {
	"url": "FzDv3XVYJDg",
	"title": "Reacting to the New Moon Knight Clip",
	"description": "Reacting to the New Moon Knight Clip by Melonie Mac Go Boom 9 months ago 16 minutes 6,743 views", "quote": ""
}, {
	"url": "F-Pssa_Rv0s",
	"title": "Andrew Garfield Says Straight Actors Should Have Opportunity to Play Gay Roles",
	"description": "Andrew Garfield Says Straight Actors Should Have Opportunity to Play Gay Roles by Melonie Mac Go Boom 9 months ago 10 minutes, 37 seconds 7,000 views", "quote": ""
}, {
	"url": "iRE691wxQxs",
	"title": "Blair Herter Leaves G4 - Is this the End?",
	"description": "Blair Herter Leaves G4 - Is this the End? by Melonie Mac Go Boom 9 months ago 22 minutes 9,016 views", "quote": ""
}, {
	"url": "hmobr-gB5w0",
	"title": "Using GIFS is Digital Blackface Now Apparently",
	"description": "Using GIFS is Digital Blackface Now Apparently by Melonie Mac Go Boom 9 months ago 12 minutes, 41 seconds 10,053 views", "quote": ""
}, {
	"url": "KeNe1WFZGzk",
	"title": "Halo TV Series Doesnt Care About the Games",
	"description": "Halo TV Series Doesnt Care About the Games by Melonie Mac Go Boom 9 months ago 16 minutes 12,597 views", "quote": ""
}, {
	"url": "gcD2pxbnAtA",
	"title": "Instagram Scolded Me for Wearing This",
	"description": "Instagram Scolded Me for Wearing This by Melonie Mac Go Boom 9 months ago 14 minutes, 27 seconds 29,299 views", "quote": ""
}, {
	"url": "1HVXHQgIDs0",
	"title": "Tomb Raider Kingdom PSOne Fan Project",
	"description": "Tomb Raider Kingdom PSOne Fan Project by Melonie Mac Go Boom 9 months ago 19 minutes 7,614 views", "quote": ""
}, {
	"url": "nq8sA3qcWBI",
	"title": "Ms Marvel Trailer Reaction",
	"description": "Ms Marvel Trailer Reaction by Melonie Mac Go Boom 10 months ago 19 minutes 16,852 views", "quote": ""
}, {
	"url": "iVDxOz1pvqk",
	"title": "Red Sonja Reboot Gets New Actress and Director?",
	"description": "Red Sonja Reboot Gets New Actress and Director? by Melonie Mac Go Boom 10 months ago 14 minutes, 17 seconds 13,009 views", "quote": ""
}, {
	"url": "ZuTHVmoFwvI",
	"title": "Wokies Cancel Anime Girl for Having a Tan",
	"description": "Wokies Cancel Anime Girl for Having a Tan by Melonie Mac Go Boom 10 months ago 17 minutes 20,232 views", "quote": ""
}, {
	"url": "20bTnXhWNjM",
	"title": "Is Perfect Dark Going Woke?",
	"description": "Is Perfect Dark Going Woke? by Melonie Mac Go Boom 10 months ago 22 minutes 10,970 views", "quote": ""
}, {
	"url": "QD0rXrNOkqU",
	"title": "Haters Trying to Cancel Me Again with Fake Tweets",
	"description": "Haters Trying to Cancel Me Again with Fake Tweets by Melonie Mac Go Boom 10 months ago 20 minutes 19,292 views", "quote": ""
}, {
	"url": "_rGmbIH-Ilc",
	"title": "Most Modern Gaming Caters to the Participation Trophy Crowd",
	"description": "Most Modern Gaming Caters to the Participation Trophy Crowd by Melonie Mac Go Boom 10 months ago 34 minutes 14,425 views", "quote": ""
}, {
	"url": "L78rYYeNvFE",
	"title": "Lost Ark Folds to the Mob - Still Not Enough For Them",
	"description": "Lost Ark Folds to the Mob - Still Not Enough For Them by Melonie Mac Go Boom 10 months ago 30 minutes 19,271 views", "quote": ""
}, {
	"url": "4DkU6pwAFSs",
	"title": "Elden Ring Didnt Fold to the Mob",
	"description": "Elden Ring Didnt Fold to the Mob by Melonie Mac Go Boom 10 months ago 28 minutes 15,209 views", "quote": ""
}, {
	"url": "O5d3sqK-4UY",
	"title": "GameSpot Talks About... Video Game Bra Sizes???",
	"description": "GameSpot Talks About... Video Game Bra Sizes??? by Melonie Mac Go Boom 10 months ago 21 minutes 25,489 views", "quote": ""
}, {
	"url": "6FxOaZB9WpU",
	"title": "Guys Dont Want to Game With Girls Any More",
	"description": "Guys Dont Want to Game With Girls Any More by Melonie Mac Go Boom 10 months ago 16 minutes 230,266 views", "quote": ""
}, {
	"url": "cE_grwGrSBI",
	"title": "Phil Spencer Says Leave Gaming Devs Alone!",
	"description": "Phil Spencer Says Leave Gaming Devs Alone! by Melonie Mac Go Boom 10 months ago 15 minutes 7,706 views", "quote": ""
}, {
	"url": "rrZHDcpJw_E",
	"title": "Stop Wussifying Westerns - The Power of the Dog",
	"description": "Stop Wussifying Westerns - The Power of the Dog by Melonie Mac Go Boom 10 months ago 23 minutes 16,698 views", "quote": ""
}, {
	"url": "-V3Q-uUT6Ww",
	"title": "New Rings of Power Leaks - Absolute Mess",
	"description": "New Rings of Power Leaks - Absolute Mess by Melonie Mac Go Boom 10 months ago 18 minutes 20,088 views", "quote": ""
}, {
	"url": "E9iM42yZNsk",
	"title": "Gaming Journos Go On Strike",
	"description": "Gaming Journos Go On Strike by Melonie Mac Go Boom 10 months ago 21 minutes 10,966 views", "quote": ""
}, {
	"url": "HhmX6n728ws",
	"title": "Charlize Theron Felt Threatened by Tom Hardy During Mad Max Fury Road Filming",
	"description": "Charlize Theron Felt Threatened by Tom Hardy During Mad Max Fury Road Filming by Melonie Mac Go Boom 10 months ago 21 minutes 11,409 views", "quote": ""
}, {
	"url": "0bANCyJ-Nfw",
	"title": "Zoe Kravitz Snubs Tifa and Aerith from Final Fantasy VII",
	"description": "Zoe Kravitz Snubs Tifa and Aerith from Final Fantasy VII by Melonie Mac Go Boom 10 months ago 18 minutes 31,052 views", "quote": ""
}, {
	"url": "tj857UcXM9w",
	"title": "Haters, Lara Croft, and Jesus - Answering Comments",
	"description": "Haters, Lara Croft, and Jesus - Answering Comments by Melonie Mac Go Boom 10 months ago 38 minutes 17,816 views", "quote": ""
}, {
	"url": "uqOn9w-OrqY",
	"title": "Crystal Dynamics Slander Classic Lara Croft Again: Tomb Raider Exhibit",
	"description": "Crystal Dynamics Slander Classic Lara Croft Again: Tomb Raider Exhibit by Melonie Mac Go Boom 10 months ago 26 minutes 24,612 views", "quote": ""
}, {
	"url": "5HOKoGDu1R0",
	"title": "Cringe Twitter Takes About Ukraine and Russia Conflict",
	"description": "Cringe Twitter Takes About Ukraine and Russia Conflict by Melonie Mac Go Boom 10 months ago 21 minutes 12,516 views", "quote": ""
}, {
	"url": "z26T9lAcld0",
	"title": "Marvel Erases Femininity Again - Valkyrie in Thor Love and Thunder",
	"description": "Marvel Erases Femininity Again - Valkyrie in Thor Love and Thunder by Melonie Mac Go Boom 10 months ago 22 minutes 16,603 views", "quote": ""
}, {
	"url": "QJ8aKcNhrbM",
	"title": "Cara Cunningham SLAMS the Woke Cancel Mob",
	"description": "Cara Cunningham SLAMS the Woke Cancel Mob by Melonie Mac Go Boom 10 months ago 17 minutes 10,301 views", "quote": ""
}, {
	"url": "y_SKFTYOmCg",
	"title": "Reacting to Libertarian Memes",
	"description": "Reacting to Libertarian Memes by Melonie Mac Go Boom 10 months ago 16 minutes 12,074 views", "quote": ""
}, {
	"url": "gmPNQ-aQE4A",
	"title": "Fans Unwoke Lara Croft",
	"description": "Fans Unwoke Lara Croft by Melonie Mac Go Boom 10 months ago 28 minutes 87,552 views", "quote": ""
}, {
	"url": "y6CEcK9S7XA",
	"title": "Why We Need Misinformation",
	"description": "Why We Need Misinformation by Melonie Mac Go Boom 10 months ago 34 minutes 14,091 views", "quote": ""
}, {
	"url": "fepMqWFu51E",
	"title": "Amazon Fail Explaining Why Galadriel is a Warrior in Rings of Power",
	"description": "Amazon Fail Explaining Why Galadriel is a Warrior in Rings of Power by Melonie Mac Go Boom 10 months ago 12 minutes, 5 seconds 36,643 views", "quote": ""
}, {
	"url": "OYXR8RmMlt0",
	"title": "Horizon Forbidden West Accused of Native American Cultural Appropriation",
	"description": "Horizon Forbidden West Accused of Native American Cultural Appropriation by Melonie Mac Go Boom 10 months ago 21 minutes 12,149 views", "quote": ""
}, {
	"url": "fgrVrkyXcrw",
	"title": "Unified Lara Croft Looks Like a Dude",
	"description": "Unified Lara Croft Looks Like a Dude by Melonie Mac Go Boom 11 months ago 23 minutes 31,990 views", "quote": ""
}, {
	"url": "ThHol35nLQo",
	"title": "Kotaku is Scared of the Hot Women Again - Lost Ark",
	"description": "Kotaku is Scared of the Hot Women Again - Lost Ark by Melonie Mac Go Boom 11 months ago 19 minutes 17,153 views", "quote": ""
}, {
	"url": "h2HsETaKrDw",
	"title": "Amazons Rings of Power Trailer Reaction! Dumpster Fire!",
	"description": "Amazons Rings of Power Trailer Reaction! Dumpster Fire! by Melonie Mac Go Boom 11 months ago 17 minutes 12,036 views", "quote": ""
}, {
	"url": "1WWxPyETp20",
	"title": "Woke Twitter Already Gaslighting Lord of the Rings Fans",
	"description": "Woke Twitter Already Gaslighting Lord of the Rings Fans by Melonie Mac Go Boom 11 months ago 18 minutes 17,245 views", "quote": ""
}, {
	"url": "bx45DhmVbG4",
	"title": "The Problem with Puritan Culture on Both Sides",
	"description": "The Problem with Puritan Culture on Both Sides by Melonie Mac Go Boom 11 months ago 31 minutes 12,896 views", "quote": ""
}, {
	"url": "Rkcx79FlkZc",
	"title": "Gina Caranos Terror on the Prairie Teaser Trailer Reaction",
	"description": "Gina Caranos Terror on the Prairie Teaser Trailer Reaction by Melonie Mac Go Boom 11 months ago 4 minutes, 49 seconds 8,223 views", "quote": ""
}, {
	"url": "3gQmgXBpefI",
	"title": "Amazons Lord of the Rings Looks Trash",
	"description": "Amazons Lord of the Rings Looks Trash by Melonie Mac Go Boom 11 months ago 21 minutes 25,653 views", "quote": ""
}, {
	"url": "9CuJRWd6jDw",
	"title": "Marvel Uglifies Artists Work Because Woke",
	"description": "Marvel Uglifies Artists Work Because Woke by Melonie Mac Go Boom 11 months ago 17 minutes 12,827 views", "quote": ""
}, {
	"url": "N5Xg-M8lkkY",
	"title": "The Woke Mob Want to Dictate Every Facet of Your Life",
	"description": "The Woke Mob Want to Dictate Every Facet of Your Life by Melonie Mac Go Boom 11 months ago 23 minutes 23,344 views", "quote": ""
}, {
	"url": "n3Ooqc6cnbE",
	"title": "Content Creator Fired Over Tweeting Song Lyrics 11 Years Ago",
	"description": "Content Creator Fired Over Tweeting Song Lyrics 11 Years Ago by Melonie Mac Go Boom 11 months ago 18 minutes 19,881 views", "quote": ""
}, {
	"url": "VWfSO8wIl48",
	"title": "Why I No Longer Host for GameStop TV",
	"description": "Why I No Longer Host for GameStop TV by Melonie Mac Go Boom 11 months ago 32 minutes 110,294 views", "quote": ""
}]