[


	{
		"url": "t8Ql9ntBQSY",
		"title": "Lizzo Episode Ranks Worst Mandalorian Episode EVER!",
		"quote": ""
	},

	{
		"url": "uRxcIXoYmp0",
		"title": "Is Dylan Mulvaney a Psyop?",
		"quote": ""
	},

	{
		"url": "P3P2dShbQc",
		"title": "Disturbing Trailer for Spider Man Across the Spider Verse",
		"quote": ""
	},

	{
		"url": "69HtmQunvLQ",
		"title": "Did Lily Gao Deserve the Backlash for Her Ada Wong Resident Evil 4 Remake Performance?",
		"quote": ""
	},

	{
		"url": "mY84RUEaizU",
		"title": "The Blue Beetle Trailer Looks Mid",
		"quote": ""
	},

	{
		"url": "OkVsjs77Hv4",
		"title": "Mandalorian Season 3 Numbers Tanked and Gina Carano Fans are Laughing",
		"quote": ""
	},


	{
		"url": "7w7T29C4TpY",
		"title": "Fired for Being Conservative and Hired by the Rippaverse",
		"quote": ""
	},

	{
		"url": "YfHVsLVRRyo",
		"title": "HBO Max Scraps Another Scooby Doo Project",
		"quote": ""
	},

	{
		"url": "g8FgyiWWYzs",
		"title": "Justin Roiland Case Dismissed - Cancel Culture Failed Again",
		"quote": ""
	},

	{
		"url": "2EtphIATTVY",
		"title": "A Tomb Raider Competitor Appears?",
		"quote": ""
	},

	{
		"url": "T1EBpTeSD40",
		"title": "Brie Larson is Mad Again - The Marvels Delay Rumors",
		"quote": ""
	},

	{
		"url": "deOkGngwKyM",
		"title": "Dragon Age Origins Writer Wants a Remaster Without EA",
		"quote": ""
	},

	{
		"url": "JXET3ZvFuFA",
		"title": "Ai Fixes Lara Croft",
		"quote": ""
	},


	{
		"url": "9GboiTTG35c",
		"title": "Hollywoods Attack on Henry Cavill Continues",
		"quote": "They hate him because he respects the fans unlike them"
	},

	{
		"url": "wPp15-_mhRk",
		"title": "Lara Croft was Race Swapped? The Actual Truth of Tomb Raiders History",
		"quote": "If anyone needs a history lesson on Lara Croft, Melonie Mac is your answer."
	},

	{
		"url": "TQIEu3d02qQ",
		"title": "Why is April ONeil Ugly in TMNT Mutant Mayhem",
		"quote": " (Melonie): Shes supposed to be a babe. Literally, in the first movie, one of the turtles -- She's a babe! Lol."
	},

	{
		"url": "5nok_wj0SJc",
		"title": "The Lord of the Rings Leads to Bigotry...Apparently",
		"quote": "Its awesome to see another YouTuber who seems to feel the same way as I do regarding discernment."
	},

	{
		"url": "Sg22g8B0xNw",
		"title": "Peter Pan and Wendy Trailer Reaction",
		"quote": "The part where Mel says its trailer time blows my mind!!! you go girl!!! 🤣"
	},

	{
		"url": "C14U36fPgOE",
		"title": "Dont Like it Dont Watch it Says The Last of Us Actress on Another Gay Episode",
		"quote": "Preach!  I like you more and more the more I watch."
	},

	{
		"url": "KaWbkrgF214",
		"title": "Karen Gillan Explains Dad Bod in Guardians of the Galaxy Volume 3 Poster",
		"quote": "LOL you got a good laugh out of me when you did the pose 😂"
	},

	{
		"url": "UOG3RA3Tk1k",
		"title": "Teacher Tells Kids Mario Characters are LGBTQRSTUV123",
		"quote": "One of your best videos. Keep them coming. We have to keep calling out this sick, ridiculous stuff."
	},

	{
		"url": "vm9cs7ubFDU",
		"title": "Warner Brothers Announces Lord of the Rings Modern Remakes",
		"quote": "Alex Steins show looked like a lot of fun 🤣 That freestyle was so goofy, loved all the points you guys covered!"
	}, {
		"url": "H8NV0P2t7cE",
		"title": "Adam Driver is OVER IT with Star Wars",
		"quote": "Melonie, you are a Prequel Fam? You are a treasure."
	}, {
		"url": "12YPVx8X2PI",
		"title": "Jason Momoa Leaving Aquaman Because The Lost Kingdom Bad",
		"quote": "Better videos when youre sick than most others when theyre well. Hope you feel better sooner than later."
	}, {
		"url": "yuVRdxgP2jg",
		"title": "Make Marvel Male Again",
		"quote": "Great commentary, Melonie. You’ve hit the nail on the head. The problem with media is narcissism moreso than any other -ism. The whole point of fantasy is to escape reality, not reproduce it in my own image."
	}, {
		"url": "dswjEKLw7K8",
		"title": "Why is Nebula a Dude in Guardians of the Galaxy Volume 3?",
		"quote": "Just so you know, tying this all to the biblical truth not only didnt scare me away, but it earned you another subscriber. Youre not afraid to call out the truth even in the face of appearing unpopular or opening yourself up to ridicule by closed-minded people."
	}, {
		"url": "4JwqL8RhIhE",
		"title": "Last Stalker Update for Now",
		"quote": "You deserve all the support you get and the community YOU have built are with you. Take care!"
	}, {
		"url": "K_ag-c7M5NY",
		"title": "Stalker Update - He Took Me to Court",
		"quote": "Keep your head up Melonie, You are doing a great job with this and you definitely go boom!"
	}, {
		"url": "KLmvyWIL5vA",
		"title": "Mark Hamill says Luke Skywalker is Gay",
		"quote": "Mark Hamill is literally becoming the poster boy for HEY FELLOW KIDS"
	}, {
		"url": "G-m-sXTsWtI",
		"title": "Elizabeth Banks Rejected by Marvel",
		"quote": "Hot babes who kick butt: BOOM, you nailed it."
	}, {
		"url": "kzO9QDgZG6U",
		"title": "Is Hogwarts Legacy Changing the Gaming Industry?",
		"quote": "I relate with your commentary and perspectives 100%. I agree that gamers tend to be rebels and rejects. Ive always connected more with people who dont fit the mold."
	}, {
		"url": "Rmu3s2Jnji4",
		"title": "Cringe V Tuber Ratiod For Harassing Hogwarts Legacy Players",
		"quote": "As a 16 year old girl, i cannot tell you how much i appreciate your work melonie! Please keep up the good motivation"
	}, {
		"url": "3-J4r3jE18A",
		"title": "Woke Disney is Going Broke and They are Panicking",
		"quote": "This girl is super cool."
	},

	{
		"url": "_F3w0fUpnHI",
		"title": "Hogwarts Legacy Breaks Twitch Record - Waaactivists are Seething",
		"description": "Hogwarts Legacy Breaks Twitch Record - Waaactivists are Seething by Melonie Mac Go Boom 1 hour ago 17 minutes 5,671 views",
		"quote": "That was the most fun i had watching a stream, looking forward to your stream right after the Nintendo Direct."
	}, {
		"url": "emV8ip5NPV8",
		"title": "Haters are Backpedaling on Hogwarts Legacy",
		"description": "Haters are Backpedaling on Hogwarts Legacy by Melonie Mac Go Boom 1 day ago 14 minutes, 1 second 56,227 views",
		"quote": "Ive been getting attacked left and right because I spoke up about this...Thank you for pushing forward with your videos regarding this."
	}, {
		"url": "fgP01lZNlDE",
		"title": "Hogwarts Legacy Flawless Victory Against the Haters",
		"description": "Hogwarts Legacy Flawless Victory Against the Haters by Melonie Mac Go Boom 2 days ago 11 minutes, 12 seconds 42,891 views",
		"quote": "Seeing this just made my day. Thank you for showing me this Melonie"
	}, {
		"url": "dxbyuPVMbCc",
		"title": "The Last of Us Tricked People Into Watching Bro on Bro Romance",
		"description": "The Last of Us Tricked People Into Watching Bro on Bro Romance by Melonie Mac Go Boom 4 days ago 11 minutes, 52 seconds 21,080 views",
		"quote": "Well I sure hope someone picks up that phone...Cause I Freaking called It - Melonie Mac"
	}, {
		"url": "cPozx02Ardo",
		"title": "People Only Want Male Superheros Says Sarah Michelle Gellar on Marvel M-She-U",
		"description": "People Only Want Male Superheros Says Sarah Michelle Gellar on Marvel M-She-U by Melonie Mac Go Boom 5 days ago 15 minutes 27,804 views",
		"quote": "Great video Melonie! I also loved that short video you made earlier! It was very funny and Im proud that youre doing what it takes to protect yourself! Keep at it!"
	}, {
		"url": "LUHzHBbBAn0",
		"title": "Velma Dresses Like Man Because Male Privilege",
		"description": "Velma Dresses Like Man Because Male Privilege by Melonie Mac Go Boom 6 days ago 14 minutes 35,568 views",
		"quote": "Glad your channel is growing fast, voices like yours are needed. This world is so crazy"
	}, {
		"url": "XMK8mGlvTxA",
		"title": "The Sims Add Transgender Update",
		"description": "The Sims Add Transgender Update by Melonie Mac Go Boom 7 days ago 22 minutes 19,607 views",
		"quote": "One of your best videos. Really good points and with a positive message"
	}, {
		"url": "8ooASUgrJEk",
		"title": "Disney Approves All Age Drag Show for Star Wars Celebration",
		"description": "Disney Approves All Age Drag Show for Star Wars Celebration by Melonie Mac Go Boom 7 days ago 12 minutes, 44 seconds 15,055 views",
		"quote": "Really enjoyed you and Jay on the WTTR Podcast. After that I watched Fat Fiction and went down a food rabbit hole. Plus Im also reading the Bible again. Thank you."
	}, {
		"url": "U323ymHmInM",
		"title": "Zachary Levi (Shazam) Cancelled by the Mob",
		"description": "Zachary Levi (Shazam) Cancelled by the Mob by Melonie Mac Go Boom 9 days ago 21 minutes 17,185 views",
		"quote": "As a father of 2 girls, your videos give me hope for their future. Keep it up!"
	}, {
		"url": "J8-1FYeEzZM",
		"title": "Mark Hamill Commits Wrongthink",
		"description": "Mark Hamill Commits Wrongthink by Melonie Mac Go Boom 11 days ago 19 minutes 37,397 views",
		"quote": "Congratulations on that silver there Melonie. The plaque may be silver, but the way you frame things, your points of view, and who you are in general is gold!"
	}, {
		"url": "lm5JH1goGcA",
		"title": "Amazon Announces Tomb Raider TV Series",
		"description": "Amazon Announces Tomb Raider TV Series by Melonie Mac Go Boom 11 days ago 11 minutes, 5 seconds 21,742 views",
		"quote": "Hey Melonie, I love your passion for classic Tomb Raider. I am so appalled what has been done to my girl Lara Croft."
	}, {
		"url": "ADJ2cRqi04k",
		"title": "Hogwarts Legacy Game Director Responds to Boycott",
		"description": "Hogwarts Legacy Game Director Responds to Boycott by Melonie Mac Go Boom 13 days ago 13 minutes, 6 seconds 76,343 views",
		"quote": "Best channel on the YouTube. Period. Thank you for everything youre doing, dear Melonie! Greetings from Germany!"
	}, {
		"url": "Ywrm4N_NeVg",
		"title": "Justin Roiland Cut from Rick and Morty Over Allegations",
		"description": "Justin Roiland Cut from Rick and Morty Over Allegations by Melonie Mac Go Boom 13 days ago 13 minutes, 55 seconds 20,767 views",
		"quote": "I remember Melonie Mac on Smosh games back in the day I never knew she was based AF."
	}, {
		"url": "AcEfz_N8D_Y",
		"title": "Daphne VA Dunked on Velma Show and it Was Glorious",
		"description": "Daphne VA Dunked on Velma Show and it Was Glorious by Melonie Mac Go Boom 2 weeks ago 19 minutes 45,073 views",
		"quote": "When you try too hard to fit in lol. This show is unacceptable and it wont last long. Another amazing video Mel, have a great rest of your day please!"
	}, {
		"url": "GD-oBNmNphw",
		"title": "Forspoken is Gonna Flop - Not Good for Square Enix",
		"description": "Forspoken is Gonna Flop - Not Good for Square Enix by Melonie Mac Go Boom 2 weeks ago 17 minutes 53,643 views",
		"quote": "Im not a gamer but I do like Melonie Macs content, great sense of humour with intelligence and decency. First saw this Lady on FNT. Plus the natural beauty is Gorgeous"
	}, {
		"url": "ERjUL_LbT_c",
		"title": "Next Tomb Raider Rushed for Perfect Dark Development?",
		"description": "Next Tomb Raider Rushed for Perfect Dark Development? by Melonie Mac Go Boom 2 weeks ago 21 minutes 27,758 views",
		"quote": "Awesome updates. Fast become one of the best content creaters."
	}, {
		"url": "U8gORvb7l4A",
		"title": "Another Frosk Rant - Quits the Gaming Industry",
		"description": "Another Frosk Rant - Quits the Gaming Industry by Melonie Mac Go Boom 2 weeks ago 21 minutes 54,693 views",
		"quote": "Its very refreshing to see someone as young as you, to have a head on their shoulders!! Thanks for the videos, keep em coming!"
	}, {
		"url": "egU_HeoWYdM",
		"title": "The Last of Us Show is Overhyped - Episode 1 Review HBO Max",
		"description": "The Last of Us Show is Overhyped - Episode 1 Review HBO Max by Melonie Mac Go Boom 2 weeks ago 30 minutes 22,685 views",
		"quote": "A very well balanced and fair review. Using notes really worked well. Also, I love the video screen shots. Enjoyed hearing your take."
	}, {
		"url": "FUegDlIfZbo",
		"title": "Streamers Will Get Cancelled for Playing Hogwarts Legacy",
		"description": "Streamers Will Get Cancelled for Playing Hogwarts Legacy by Melonie Mac Go Boom 2 weeks ago 13 minutes, 5 seconds 197,279 views",
		"quote": "Thank you for this. We need more fearless people in the gaming sphere. Subscribed! ❤"
	}, {
		"url": "5YitA7xmq2w",
		"title": "Velma is an Abomination on HBO Max",
		"description": "Velma is an Abomination on HBO Max by Melonie Mac Go Boom 3 weeks ago 13 minutes, 52 seconds 83,030 views",
		"quote": "You cant even woke right is my new favourite sentence"
	}, {
		"url": "e30yl0hwaYg",
		"title": "Non Binary Priest Says God Loves Variety",
		"description": "Non Binary Priest Says God Loves Variety by Melonie Mac Go Boom 2 days ago 46 minutes 15,902 views",
		"quote": "Im not even Christian but I just love how you respect your faith and religion. your videos are excellent melonie! thank you for making them! Im your biggest french fan! also Im learning english a lot when Im watching your videos!"
	}, {
		"url": "l5DgM9yU2nU",
		"title": "Why Hogwarts Legacy Continues to Succeed Despite Cancel Mob",
		"description": "Why Hogwarts Legacy Continues to Succeed Despite Cancel Mob by Melonie Mac Go Boom 4 days ago 18 minutes 41,363 views",
		"quote": "its fun to own the wokies sometimes  lol I just recently discovered your channel and Im really enjoying your videos.    you go boom girl."
	}, {
		"url": "IknI7tpYBZY",
		"title": "Ubisoft is Cancelling More Games - Something Has Got to Change",
		"description": "Ubisoft is Cancelling More Games - Something Has Got to Change by Melonie Mac Go Boom 4 days ago 15 minutes 37,966 views",
		"quote": "dang  melonie... you ve been cracking out fire video after fire video lately! and you ve been dropping the truths that people need to hear!"
	}, {
		"url": "oUwB54SSIsc",
		"title": "Hate Campaign BACKFIRES - Hogwarts Legacy",
		"description": "Hate Campaign BACKFIRES - Hogwarts Legacy by Melonie Mac Go Boom 7 days ago 13 minutes, 7 seconds 62,759 views",
		"quote": "so glad melonie went on her own.... this channel is the best! she would never have been able to be true about this shiznit before!"
	}, {
		"url": "nM_als-QGP0",
		"title": "Woman Fired from Limited Run Games for Being a Conservative Christian",
		"description": "Woman Fired from Limited Run Games for Being a Conservative Christian by Melonie Mac Go Boom 9 days ago 13 minutes, 4 seconds 48,990 views",
		"quote": "Id take one melonie  over ten thousand jlaws.  just sayin .   keep rockin  it  mel.  youre a beauty in every possible way."
	}, {
		"url": "JrMwZV57Myc",
		"title": "Silent Hill 2 Remake Less Scary for Modern Audiences",
		"description": "Silent Hill 2 Remake Less Scary for Modern Audiences by Melonie Mac Go Boom 10 days ago 12 minutes, 16 seconds 25,726 views",
		"quote": "yeah! you said it melonie! studios  make new stories and franchises! same goes with movies! make new stuff for modern audiences and if they wanna remake the legendary "
	}, {
		"url": "EBnS4_LoFVM",
		"title": "Wokies REEE over Hogwarts Legacy Preorders",
		"description": "Wokies REEE over Hogwarts Legacy Preorders by Melonie Mac Go Boom 10 days ago 22 minutes 78,468 views",
		"quote": "dont listen the hate melonie. keep being you. its what draws me to your content. you help people."
	}, {
		"url": "I6Yqg4ISHS0",
		"title": "So... the Joker is Pregnant Now",
		"description": "So... the Joker is Pregnant Now by Melonie Mac Go Boom 12 days ago 11 minutes, 46 seconds 28,603 views",
		"quote": "pregnant as a man with a mud baby.....what the actual f  - great video melonie  keep going boom"
	}, {
		"url": "EA9U7v6AYPE",
		"title": "Reacting to Liam Hemsworth as Geralt in The Witcher Season 4 on Netflix",
		"description": "Reacting to Liam Hemsworth as Geralt in The Witcher Season 4 on Netflix by Melonie Mac Go Boom 12 days ago 15 minutes 26,102 views",
		"quote": "you do some of the funniest faces for your thumbnails melonie I swear to God"
	}, {
		"url": "6WvGmDDIz0A",
		"title": "UPDATE: Jeremy Renner Airlifted to Hospital in Critical Condition",
		"description": "UPDATE: Jeremy Renner Airlifted to Hospital in Critical Condition by Melonie Mac Go Boom 13 days ago 12 minutes, 34 seconds 19,487 views",
		"quote": ""
	}, {
		"url": "7_gpJ1fayso",
		"title": "The Witcher Blood Origin Episode Review",
		"description": "The Witcher Blood Origin Episode Review by Melonie Mac Go Boom 2 weeks ago 19 minutes 29,613 views",
		"quote": "youre the kindest and most respectful of the creators. thank you and a very happy new year  melonie."
	}, {
		"url": "3Ae90mTyVPw",
		"title": "So I have a Stalker",
		"description": "So I have a Stalker by Melonie Mac Go Boom 2 weeks ago 22 minutes 98,587 views",
		"quote": "Im perfectly happy with my wife of 34 years. I enjoy watching melonies videos because unlike most of the other online critics she isnt approaching her subject matter with anger and hatred  she seems genuinely amused at the insanity of the woke culture but keeps herself upbeat."
	}, {
		"url": "iMFI4TDLhsk",
		"title": "James Gunn Denies DCEU Complete Recast But I Think He Is Lying",
		"description": "James Gunn Denies DCEU Complete Recast But I Think He Is Lying by Melonie Mac Go Boom 3 weeks ago 15 minutes 24,485 views",
		"quote": "thats why I subscribed to your channel in the first place    keep doing the wonderful work youre doing  melonie! merry Christmas to you  miss mac! God bless you all the way! go boom!"
	}, {
		"url": "ydM0V7TiMmo",
		"title": "Hollywood Hates Henry Cavill - They Dont Deserve Superman",
		"description": "Hollywood Hates Henry Cavill - They Dont Deserve Superman by Melonie Mac Go Boom 1 month ago 12 minutes, 24 seconds 34,435 views",
		"quote": "loved the video. ya you hit the right points about cavill. hes a fan of a lot of good material. no one should ever apologize for being a masculine man lol."
	}, {
		"url": "VWs3iQHbEE8",
		"title": "Tomb Raider Teams With Amazon Games to Publish Lara Crofts Next Game",
		"description": "Tomb Raider Teams With Amazon Games to Publish Lara Crofts Next Game by Melonie Mac Go Boom 1 month ago 19 minutes 32,620 views",
		"quote": "I just wanted to pop in and say in regards to tuesdays video  just how proud I am of you for that video. I would argue that was one of the most necessary things you ve ever produced. it has such an important message given the times were living in."
	}, {
		"url": "D7HNu6By1Rw",
		"title": "Woke Ideology is Satanic",
		"description": "Woke Ideology is Satanic by Melonie Mac Go Boom 1 month ago 33 minutes 40,405 views",
		"quote": "you put my thoughts into perfect words. Im not religious and Im fully anti woke globalism  but I respect melonies argument and faith as well!"
	}, {
		"url": "2xBU296IOSc",
		"title": "Netflix to Ruin My Hero Academia in Live Action",
		"description": "Netflix to Ruin My Hero Academia in Live Action by Melonie Mac Go Boom 1 month ago 12 minutes, 23 seconds 15,787 views",
		"quote": "this!! thanks for saying such a timeless piece of truth  melonie!"
	}, {
		"url": "LcIndxO4bZI",
		"title": "BREAKING: Jennifer Lawrence Invented Women",
		"description": "BREAKING: Jennifer Lawrence Invented Women by Melonie Mac Go Boom 1 month ago 12 minutes, 35 seconds 50,618 views",
		"quote": "melonie mac taking no prisoners today!"
	}, {
		"url": "G52WmbfsqUY",
		"title": "New Lara Croft Shm3xh Doll Just Dropped - Tomb Raider",
		"description": "New Lara Croft Shm3xh Doll Just Dropped - Tomb Raider by Melonie Mac Go Boom 1 month ago 11 minutes, 21 seconds 131,516 views",
		"quote": "melonies reactions are the best. especially when she kept accidentally going to the wrong screen."
	}, {
		"url": "Ce7IWkxKCa4",
		"title": "Dead Space Remake is Uglifying Their Women",
		"description": "Dead Space Remake is Uglifying Their Women by Melonie Mac Go Boom 1 month ago 12 minutes, 52 seconds 68,687 views",
		"quote": "if I can look that good at her age  Ill know Ive  made it ."
	}, {
		"url": "KIhq_Eh5g-A",
		"title": "Marvel Making BIG Changes to Save Phases 5 and 6 of the MCU",
		"description": "Marvel Making BIG Changes to Save Phases 5 and 6 of the MCU by Melonie Mac Go Boom 1 month ago 13 minutes, 46 seconds 21,356 views",
		"quote": "thanks! melonie youre bringing some terrific energy on a dreary monday.   the spider-man 90 s cartoon is next level awesomeness. "
	}, {
		"url": "TORhCaaM6yQ",
		"title": "Is Princess Peach Woke in the Super Mario Bros Movie?",
		"description": "Is Princess Peach Woke in the Super Mario Bros Movie? by Melonie Mac Go Boom 1 month ago 11 minutes 41,714 views",
		"quote": "this is exactly how I feel. peach can be a  boss   sure  but not in such cliched  lazy  stereotypically feminist ways. rather  shes courageous  decisive  protective  honorable  i.e.  the qualities you d hope to find among royalty."
	}, {
		"url": "BwSDlNndU5w",
		"title": "DC is Rebuilding - canthey just give the fans what we want already?",
		"description": "DC is Rebuilding - canthey just give the fans what we want already? by Melonie Mac Go Boom 1 month ago 12 minutes, 59 seconds 17,695 views",
		"quote": "youre not alone in this fight  melonie. God, I and many others  are with you."
	}, {
		"url": "77FVvdoWgbw",
		"title": "Simu Liu Slams Tarantino Because He is Irrelevant and Jealous",
		"description": "Simu Liu Slams Tarantino Because He is Irrelevant and Jealous by Melonie Mac Go Boom 1 month ago 19 minutes 36,879 views",
		"quote": "melonie pronouncing names is one of my favorite things."
	}, {
		"url": "VbYvWwLP2Cw",
		"title": "Marvel Doesnt Like Hiring Comic Book Fans",
		"description": "Marvel Doesnt Like Hiring Comic Book Fans by Melonie Mac Go Boom 1 month ago 12 minutes, 27 seconds 25,090 views",
		"quote": "Ive been saying this for a long time about media not specifically marvel but in general. thanks melonie keep making more videos keep fighting and again happy birthday."
	}, {
		"url": "aLMv0bb7_SY",
		"title": "Oh No Mario is White in the Super Mario Bros Movie!",
		"description": "Oh No Mario is White in the Super Mario Bros Movie! by Melonie Mac Go Boom 1 month ago 12 minutes, 8 seconds 29,909 views",
		"quote": "melonie! youre doing a great job!  keep it up and God bless!"
	}, {
		"url": "_cxTgqnBCFA",
		"title": "Identity Obsession is Tanking the MCU: She Hulk, Ironheart, and More",
		"description": "Identity Obsession is Tanking the MCU: She Hulk, Ironheart, and More by Melonie Mac Go Boom 1 month ago 20 minutes 37,076 views",
		"quote": "you hit the nail on the head melonie. I really enjoy your videos. I always look forward to them. take care of yourself."
	}, {
		"url": "ZabvcDTvVXQ",
		"title": "Actors Still Bullying Tolkien Fans Into Supporting Amazons Lord of the Rings: Rings of Power",
		"description": "Actors Still Bullying Tolkien Fans Into Supporting Amazons Lord of the Rings: Rings of Power by Melonie Mac Go Boom 1 month ago 12 minutes, 47 seconds 30,770 views",
		"quote": "awesome video again.  Im reminded by a george carlin bit where he said   thats how the ruling class acts in any society  keep the lower classes fighting among themselves while they keep going to the bank.  keep up the great work melonie!"
	}, {
		"url": "RLscmQnpfeg",
		"title": "Female Pirates of the Caribbean Cancelled According to Margot Robbie",
		"description": "Female Pirates of the Caribbean Cancelled According to Margot Robbie by Melonie Mac Go Boom 2 months ago 17 minutes 28,266 views",
		"quote": "love hearing your thoughts on this melonie mac. you brought the boom and love it. also glad this pos all female pirates of the caribbean movie was cancelled. awesome news the timeline is healing boys!"
	}, {
		"url": "RYFrikrUEII",
		"title": "Indiana Jones Replaced by a Woman? Test Screening Possible Endings Suggest",
		"description": "Indiana Jones Replaced by a Woman? Test Screening Possible Endings Suggest by Melonie Mac Go Boom 2 months ago 12 minutes, 59 seconds 30,282 views",
		"quote": "to be fair  I d watch the hell out of melonie mac as indiana jones"
	}, {
		"url": "RXykcwN7Y-w",
		"title": "Marvels Blade Movie Being Rewritten? Woke Underworld Clone?",
		"description": "Marvels Blade Movie Being Rewritten? Woke Underworld Clone? by Melonie Mac Go Boom 2 months ago 13 minutes, 3 seconds 75,573 views",
		"quote": "we definitely dont seem to be gettng top quality shows and movies like we used too. Im right there with ya melonie. I usually love these types of movies. and I loved underworld. this is very interesting. great video melonie. enjoy your day. give your dad and brothers a hug from us. and take care melonie."
	}, {
		"url": "yDgUnyy_23Q",
		"title": "Fable Reboot is Going Woke As Per Xbox",
		"description": "Fable Reboot is Going Woke As Per Xbox by Melonie Mac Go Boom 2 months ago 11 minutes, 22 seconds 58,301 views",
		"quote": "thank you for your daily boldness and courage for speaking out against these things  melonie! be of good courage  and he shall strengthen your heart  all ye that hope in the Lord."
	}, {
		"url": "VD19e4Vwb_U",
		"title": "Rings of Power Gets a Reboot? Amazon is Panicking!",
		"description": "Rings of Power Gets a Reboot? Amazon is Panicking! by Melonie Mac Go Boom 2 months ago 16 minutes 85,664 views",
		"quote": "I love and am passionate about myself because I can no longer sit and watch them butcher all of it.. it was the last straw for me. keep it up melonie! love listening to you talking about these things!"
	}, {
		"url": "SXv-ol22jMw",
		"title": "Final Fantasy XVI SLAMMED for Whiteness",
		"description": "Final Fantasy XVI SLAMMED for Whiteness by Melonie Mac Go Boom 2 months ago 12 minutes, 20 seconds 39,189 views",
		"quote": "excellent commentary  melonie. I particularly liked the nod to yoko taro at the end. boom!"
	}, {
		"url": "QFNdMbXJLHY",
		"title": "The Witcher Fans DEMAND Henry Cavill Return",
		"description": "The Witcher Fans DEMAND Henry Cavill Return by Melonie Mac Go Boom 2 months ago 12 minutes 30,602 views",
		"quote": "too many subjects to talk about is a great problem to have melonie. I love hearing your unfiltered opinions. have a great day."
	}, {
		"url": "SHFsX36Y1uA",
		"title": "Emma DArcey Makes Men of the Year List - House of the Dragon Star",
		"description": "Emma DArcey Makes Men of the Year List - House of the Dragon Star by Melonie Mac Go Boom 2 months ago 12 minutes, 13 seconds 49,504 views",
		"quote": "what is the world coming to... I have no words lol thank God for you melonie for having common sense with the rest of us who do!"
	}, {
		"url": "t6dN1IfOlmw",
		"title": "Live Action Hercules Inspired by Tiktok? Disney Have Lost their Minds",
		"description": "Live Action Hercules Inspired by Tiktok? Disney Have Lost their Minds by Melonie Mac Go Boom 2 months ago 12 minutes, 48 seconds 26,816 views",
		"quote": "I dunno how chapek thinks disney will survive the next 100 yrs when they keep churning out garbage like this. as always fantastic insights melonie."
	}, {
		"url": "y61EX10jvLo",
		"title": "G4s Frosk Attacks Henry Cavill",
		"description": "G4s Frosk Attacks Henry Cavill by Melonie Mac Go Boom 2 months ago 13 minutes, 36 seconds 91,805 views",
		"quote": "for exactly that reason  have you never noticed how much it upsets them  woke mob  if you dont want to waste your energy arguing with them. parasites always need something to feed on."
	}, {
		"url": "S52N-xr_p_Y",
		"title": "Marvel Ruined Namor in Black Panther: Wakanda Forever",
		"description": "Marvel Ruined Namor in Black Panther: Wakanda Forever by Melonie Mac Go Boom 2 months ago 11 minutes, 23 seconds 115,208 views",
		"quote": "I remember a while back seeing an article thatsaid they discovered underwater pyramids by the caribbean or gulf of mexico which were being linked to possibly being  atlantis . its an interesting take on the character  they have to do something to differentiate namor and aquaman"
	}, {
		"url": "MlisggXZiHs",
		"title": "Kotaku Blames Gamergate for PelosI Attack",
		"description": "Kotaku Blames Gamergate for PelosI Attack by Melonie Mac Go Boom 2 months ago 12 minutes, 48 seconds 17,091 views",
		"quote": "I have to say. you handle the back lash very well melonie. and remember were here for you."
	}, {
		"url": "rvkQixmNYlo",
		"title": "She Hulk Somehow Got Nominated for an Award",
		"description": "She Hulk Somehow Got Nominated for an Award by Melonie Mac Go Boom 2 months ago 11 minutes, 8 seconds 53,144 views",
		"quote": "you look a hell of a lot closer to the original comic than any on screen interpretation I have seen to date. good job! gold"
	}, {
		"url": "6Mu_D6ZYASE",
		"title": "Henry Cavill Quits The Witcher",
		"description": "Henry Cavill Quits The Witcher by Melonie Mac Go Boom 2 months ago 12 minutes, 14 seconds 100,293 views",
		"quote": "I dont have an opinion on this but I would like to point out how beautiful melonie is. theres no way you cant notice but its always worth mentioning"
	}, {
		"url": "J7On4DLGL3E",
		"title": "Peeps Mad That Bayonetta Likes Dudes",
		"description": "Peeps Mad That Bayonetta Likes Dudes by Melonie Mac Go Boom 2 months ago 13 minutes, 31 seconds 70,162 views",
		"quote": "The 3 girls I know that are really into games all love Bayonetta. They are straight. These people dont deserve attention, theyve been given to much"
	}, {
		"url": "5tKlAKmr7t0",
		"title": "Gamers are Bigots According to Study",
		"description": "Gamers are Bigots According to Study by Melonie Mac Go Boom 2 months ago 14 minutes, 49 seconds 55,470 views",
		"quote": "melonie is over 9000 in this one!"
	}, {
		"url": "ki-AZeEPN7w",
		"title": "Amazon Desperate to Fix Rings of Power",
		"description": "Amazon Desperate to Fix Rings of Power by Melonie Mac Go Boom 2 months ago 11 minutes, 1 second 58,007 views",
		"quote": "dont think this dumpster fire is fixable  but that just means more geat videos from melonie! youre awesome melonie  keep up the great work."
	}, {
		"url": "ECU6WZXwzD4",
		"title": "Netflix The Witcher Producer says Writers Hate the Books and Games",
		"description": "Netflix The Witcher Producer says Writers Hate the Books and Games by Melonie Mac Go Boom 2 months ago 10 minutes, 4 seconds 59,014 views",
		"quote": "I want to say something witty and smartass but melonie is so damn wholesome and likeable. the fandom menace is a better place with her in it."
	}, {
		"url": "oNMm6gj3NOo",
		"title": "Welp, Bayonetta Voice Actress Lied",
		"description": "Welp, Bayonetta Voice Actress Lied by Melonie Mac Go Boom 2 months ago 11 minutes, 34 seconds 63,825 views",
		"quote": "hey melonie. Im a 16 year old boy from south africa your videos help me so much. they heal me when I feel sad and they help. you ve also restored my faith in God after a hard year."
	}, {
		"url": "ecIP1BdlAgg",
		"title": "The Updated for a Modern Audience Curse",
		"description": "The Updated for a Modern Audience Curse by Melonie Mac Go Boom 2 months ago 15 minutes 185,424 views",
		"quote": "real talk. its nice to see real women gamers  talking about the real shit...talking about whats happening around us. bravo. keep keeping it real. go boom"
	}, {
		"url": "zBn2idm7XLk",
		"title": "She Hulk Creators say Show Was Bad on Purpose",
		"description": "She Hulk Creators say Show Was Bad on Purpose by Melonie Mac Go Boom 2 months ago 12 minutes, 26 seconds 119,464 views",
		"quote": "I really like your post melonie   very insightful and right on. thanks   I think mcu really slipped and went down hill  and its a shame. I do really enjoy your thoughtful and witty discussions."
	}, {
		"url": "dWhZ396M4Kg",
		"title": "Kotaku Hating on White Men Again - Ethan Winters and James Sunderland",
		"description": "Kotaku Hating on White Men Again - Ethan Winters and James Sunderland by Melonie Mac Go Boom 2 months ago 13 minutes, 16 seconds 62,727 views",
		"quote": "the world makes me angry  but melonie mac brings positivity and inspiration to us all. Ive been a fan for I think what must be a decade now. keep fighting the good fight miss mac!"
	}, {
		"url": "EtEirDkYKq8",
		"title": "No More Flash for Ezra Miller",
		"description": "No More Flash for Ezra Miller by Melonie Mac Go Boom 2 months ago 11 minutes, 44 seconds 63,122 views",
		"quote": "go woke  go broke.  always good to see you melonie. I love to hear your takes  even if I dont 100  agree with all of them  I mean a agree probably 99% all the time. until next time. go boom."
	}, {
		"url": "hcx4go3aulc",
		"title": "Ex G4TV Employee Snaps at Me",
		"description": "Ex G4TV Employee Snaps at Me by Melonie Mac Go Boom 2 months ago 13 minutes, 6 seconds 78,304 views",
		"quote": "melonie mac is a kindly soul. over 2 years ago she bothered to take time to voice support toward me in a comment section when I was going through the initial part of a separation that led to my divorce. shes a legit nice person  and only a very very sick person would misinterpret that."
	}, {
		"url": "lE_WPljwi_k",
		"title": "She Hulk Director on Sex Positivity for Kids",
		"description": "She Hulk Director on Sex Positivity for Kids by Melonie Mac Go Boom 2 months ago 12 minutes, 53 seconds 70,119 views",
		"quote": "you know what makes me happy  how many female youtubers Im seeing calling out this shit. God bless the melonie macs of the world  we need strong women like them right now more than ever before."
	}, {
		"url": "xyvxgntfr8s",
		"title": "G4TV is Gone Forever",
		"description": "G4TV is Gone Forever by Melonie Mac Go Boom 2 months ago 12 minutes, 9 seconds 65,694 views",
		"quote": "keeping it real  g4 needed a melonie mac  someone who is a gamer who has their own opinions but treats everyone with genuine respect."
	}, {
		"url": "iGxbUt3lgOM",
		"title": "So the Rings of Power Finale Sucked",
		"description": "So the Rings of Power Finale Sucked by Melonie Mac Go Boom 3 months ago 15 minutes 52,519 views",
		"quote": "melonie--your muppet voices and dialogue when recapping is way more entertaining than having to suffer through the actual show!!"
	}, {
		"url": "DIrWUzLfgfk",
		"title": "She Hulk Season Finale Was Dreadful",
		"description": "She Hulk Season Finale Was Dreadful by Melonie Mac Go Boom 3 months ago 15 minutes 128,540 views",
		"quote": "I would ve been utterly annoyed by wasting my time watching this series lmao. thank you for your sacrifice"
	}, {
		"url": "W4K0vnsyVic",
		"title": "Chainsaw Man Episode 1 Anime Review",
		"description": "Chainsaw Man Episode 1 Anime Review by Melonie Mac Go Boom 3 months ago 12 minutes, 31 seconds 14,842 views",
		"quote": "I love her anime reviews she really put me on future diary several years ago"
	}, {
		"url": "8uKSPczUkak",
		"title": "HBO Emasculates Fred in Velma Scooby Doo Spinoff",
		"description": "HBO Emasculates Fred in Velma Scooby Doo Spinoff by Melonie Mac Go Boom 3 months ago 13 minutes, 38 seconds 178,955 views",
		"quote": "I appreciate that melonie can uplift men without tearing other women down"
	}, {
		"url": "GSS2MwfbbSM",
		"title": "Gay Superman is Cancelled",
		"description": "Gay Superman is Cancelled by Melonie Mac Go Boom 3 months ago 13 minutes, 11 seconds 48,054 views",
		"quote": "well your channel is entertaining af! at least we have that! btw  Im an actual real-life o.g. boomer. old  but with a few functioning brain cells left! keep speaking your mind  its so refreshing!! subscribed and followed on twitter. thank you  melonie!"
	}, {
		"url": "e1AspAT5jCk",
		"title": "HBO Fixed Daphne in Velma Scooby Doo Spinoff",
		"description": "HBO Fixed Daphne in Velma Scooby Doo Spinoff by Melonie Mac Go Boom 3 months ago 12 minutes, 54 seconds 248,486 views",
		"quote": "melonie is like the cool big sister I wish I had"
	}, {
		"url": "FPKyEViVgPQ",
		"title": "How is Rings of Power STILL this bad at Episode 7?!",
		"description": "How is Rings of Power STILL this bad at Episode 7?! by Melonie Mac Go Boom 3 months ago 14 minutes, 5 seconds 33,138 views",
		"quote": "I just recently discovered your channel ms. melonie and I appreciate your honesty and good sense  so I subscribed.  looking forward to watching many more of your vids. "
	}, {
		"url": "J3feH7uR_7k",
		"title": "Was Daredevil Enough to Redeem She Hulk?",
		"description": "Was Daredevil Enough to Redeem She Hulk? by Melonie Mac Go Boom 3 months ago 16 minutes 55,276 views",
		"quote": "so glad that I found your channel  melonie. youre really getting at the heart of these pandering types of shows without becoming a toxic basher yourself."
	}, {
		"url": "GN3q1Zr1Glg",
		"title": "Streaming Shows are Fudging Their Numbers",
		"description": "Streaming Shows are Fudging Their Numbers by Melonie Mac Go Boom 3 months ago 10 minutes, 32 seconds 22,631 views",
		"quote": "thank you for reporting this  melonie. I really appreciate your news updates and views on current media trends. sad to see so much corporate corruption out there.  but glad we have people like yourself brave enough to stand up and say something about it. stay true  always. new sub."
	}, {
		"url": "iCx2H4u2jLw",
		"title": "Wakanda Forever: Woke Trash or Possibly Good?",
		"description": "Wakanda Forever: Woke Trash or Possibly Good? by Melonie Mac Go Boom 3 months ago 12 minutes, 50 seconds 30,229 views",
		"quote": "you my lady  are a gem. great channel   great review work. best of luck  have a great day."
	}, {
		"url": "XPxwSxtS0hk",
		"title": "She Hulk Actress Doesnt Care that the Show Sucks",
		"description": "She Hulk Actress Doesnt Care that the Show Sucks by Melonie Mac Go Boom 3 months ago 12 minutes, 57 seconds 86,508 views",
		"quote": "I used to have a crush on melonie years ago during league days  then kinda lost track of the whole entertainment scene for a while but Im glad Im back  not to have a crush on melonie again but to truly admire the kind of person shes evolved into. much respect."
	}, {
		"url": "QBZsTWjJWL0",
		"title": "Breaking News: Hating on Men Wont Make Them Watch Your Movie",
		"description": "Breaking News: Hating on Men Wont Make Them Watch Your Movie by Melonie Mac Go Boom 3 months ago 15 minutes 173,668 views",
		"quote": "just found your channel  love the content. your so on point"
	}, {
		"url": "JYImlB-rLe8",
		"title": "Im Good at Playing Women says Non Binary House of the Dragon Actor Emma Darcy",
		"description": "Im Good at Playing Women says Non Binary House of the Dragon Actor Emma Darcy by Melonie Mac Go Boom 3 months ago 25 minutes 85,697 views",
		"quote": "thanks melonie for being a strong independent woman who doesnt hate men. its super refreshing to hear women like you speak up!"
	}, {
		"url": "x716OOiXxOk",
		"title": "Rings of Power is a Giant Meme",
		"description": "Rings of Power is a Giant Meme by Melonie Mac Go Boom 3 months ago 15 minutes 52,618 views",
		"quote": "melonie mac go boom   hi melonie and thank you!  your content always lighten up my mood!  kind greetings  a fan from good old europe"
	}, {
		"url": "lfZQbyI7SI8",
		"title": "She Hulk is a Bad Example for Women",
		"description": "She Hulk is a Bad Example for Women by Melonie Mac Go Boom 3 months ago 14 minutes, 13 seconds 97,461 views",
		"quote": "everyone loves when someone hates on she hulk  it brings us together and spreads happiness."
	}, {
		"url": "LKYr4COTYDQ",
		"title": "Rings of Power Fans are Insecure",
		"description": "Rings of Power Fans are Insecure by Melonie Mac Go Boom 3 months ago 13 minutes, 19 seconds 49,076 views",
		"quote": "I could not stop laughing when melonie pointed out that guyladriel was one of the least paid actors. amazon enforcing that gender pay gap!"
	}, {
		"url": "c9H_UiRpfAg",
		"title": "Rings of Power Continues to be an Embarrassment",
		"description": "Rings of Power Continues to be an Embarrassment by Melonie Mac Go Boom 3 months ago 15 minutes 71,657 views",
		"quote": "melonie  I appreciate how you get right into your videos instead of how other channels will ramble on and seemingly never get to the point. you are a breath of fresh air."
	}, {
		"url": "UNmGPIwKazs",
		"title": "She Hulk Fans are Mad at Men As Usual",
		"description": "She Hulk Fans are Mad at Men As Usual by Melonie Mac Go Boom 3 months ago 12 minutes, 38 seconds 233,952 views",
		"quote": "melonie   we need men and men need us.   so true!  keep spreading that message!"
	}, {
		"url": "lpYodKJv-J0",
		"title": "The Wussification of James Bond",
		"description": "The Wussification of James Bond by Melonie Mac Go Boom 3 months ago 12 minutes, 11 seconds 30,357 views",
		"quote": "honestly dont know how you do this as these crazy ahs must wear you down. great to see regular rational people still exist. melonie you give me hope! keep on booming!"
	}, {
		"url": "mOJQ1F_oSDo",
		"title": "Splinter Cell is Going Woke",
		"description": "Splinter Cell is Going Woke by Melonie Mac Go Boom 3 months ago 10 minutes, 58 seconds 33,825 views",
		"quote": "melonie you always make all this bad news much easier to digest."
	}, {
		"url": "Lfw8HL3gfz0",
		"title": "Amazon Scraps Conan Because Men Bad",
		"description": "Amazon Scraps Conan Because Men Bad by Melonie Mac Go Boom 3 months ago 15 minutes 155,116 views",
		"quote": "ahh the queen replied to me!!! congratulations with the success this channel is getting. dont stop speaking your mind. I feel represented by your views."
	}, {
		"url": "xtllcx5bOrg",
		"title": "Looks Like G4TV Fired Frosk",
		"description": "Looks Like G4TV Fired Frosk by Melonie Mac Go Boom 3 months ago 11 minutes, 52 seconds 49,862 views",
		"quote": "thanks  great commentary  and compassionate view  as much as she earned this it is wise to remember many have lost their jobs over her mishandling of the brand. truly unfortunate for so many. also  spot on we are all flawed  and best if we could all just improve. earned my subscription"
	}, {
		"url": "SqAz_DyPLRo",
		"title": "Should Twitch Ban Gambling Over ItsSliker Scam?",
		"description": "Should Twitch Ban Gambling Over ItsSliker Scam? by Melonie Mac Go Boom 3 months ago 11 minutes, 10 seconds 5,186 views",
		"quote": "wow melonie is on a tear with the uploads lately.  love it!"
	}, {
		"url": "eGchnywNqww",
		"title": "Woke Overwatch Fans Are Offended by Kiriko",
		"description": "Woke Overwatch Fans Are Offended by Kiriko by Melonie Mac Go Boom 3 months ago 14 minutes, 7 seconds 54,544 views",
		"quote": "getting rid of those is hard! took me a while to get  it right and be consistent. melonie has helped so many people with that."
	}, {
		"url": "JwjBI1VKfXo",
		"title": "Frosk is Hurting G4s Reputation Again",
		"description": "Frosk is Hurting G4s Reputation Again by Melonie Mac Go Boom 4 months ago 13 minutes, 42 seconds 58,172 views",
		"quote": "melonie mac is such a classy lady. respect to this based individual"
	}, {
		"url": "EQJz1D1O3IQ",
		"title": "Representation Activism is Narcissism",
		"description": "Representation Activism is Narcissism by Melonie Mac Go Boom 4 months ago 17 minutes 22,333 views",
		"quote": "very well put melonie.  I cant think of a single point to argue.  thank you for putting your perspective out there."
	}, {
		"url": "3tMLZEfEfpk",
		"title": "Brie Larson Goes Karen Again",
		"description": "Brie Larson Goes Karen Again by Melonie Mac Go Boom 4 months ago 17 minutes 50,080 views",
		"quote": "what really hooked me was learning that your a Christian and how open you are about your faith. then the fact that youre a tomboy and all the fun  cool stuff youre into. I mean  I think your one of the most amazing women on the planet. I dont have a problem supporting you at all. good video. take care melonie."
	}, {
		"url": "Q_pkvy7C9OM",
		"title": "The She Hulk Hypocrisy Keeps Gettng Worse",
		"description": "The She Hulk Hypocrisy Keeps Gettng Worse by Melonie Mac Go Boom 4 months ago 16 minutes 23,827 views",
		"quote": "hey melonie I just wanted to tell you that you are doing a great job with making videos and talking about each movies and tv shows and video games and everything else that is on your mind."
	}, {
		"url": "PHMraoyXoGE",
		"title": "Bad News Tomb Raider is DOA",
		"description": "Bad News Tomb Raider is DOA by Melonie Mac Go Boom 4 months ago 13 minutes, 17 seconds 19,284 views",
		"quote": "the fact that melonie mentioned tomb raider for the ps1  brought so much joy to my heart. stay amazing  God bless and game on."
	}, {
		"url": "FHJVo8grtcc",
		"title": "Elijah Wood Simps for Rings of Power",
		"description": "Elijah Wood Simps for Rings of Power by Melonie Mac Go Boom 4 months ago 12 minutes, 3 seconds 9,111 views",
		"quote": "its good to see you back at it. but I dont want the negativity to bring you down. remember praying for ya and we got your back melonie."
	}, {
		"url": "PwISZpxCfVQ",
		"title": "Rings of Power Reviews Have Dropped",
		"description": "Rings of Power Reviews Have Dropped by Melonie Mac Go Boom 4 months ago 14 minutes, 25 seconds 16,458 views",
		"quote": "in the land of the blind melonie mac is a visionary. cheers."
	}, {
		"url": "C39jvmKRk4A",
		"title": "Red Sonja Unwokes Itself?",
		"description": "Red Sonja Unwokes Itself? by Melonie Mac Go Boom 4 months ago 10 minutes, 44 seconds 20,544 views",
		"quote": "I have zero faith in anything coming out of hollywood.. channels like melonies are awesome   come from a place of passion"
	}, {
		"url": "tadBBGMeXJI",
		"title": "Progressives are Hijacking Christianity",
		"description": "Progressives are Hijacking Christianity by Melonie Mac Go Boom 5 months ago 21 minutes 21,201 views",
		"quote": "melonie  well said! I appreciate how you handled the Bible passages and explained them. this is a much needed message and you addressed it well. thank you."
	}, {
		"url": "HVUaki-wovE",
		"title": "Prey (Predator) Movie Review",
		"description": "Prey (Predator) Movie Review by Melonie Mac Go Boom 5 months ago 14 minutes, 3 seconds 14,609 views",
		"quote": "good video melonie. Im looking forward to the next Godzilla movie. you get two thumbs up"
	}, {
		"url": "JZmtWhqszLE",
		"title": "New Tomb Raider Game Alleged Leaks",
		"description": "New Tomb Raider Game Alleged Leaks by Melonie Mac Go Boom 5 months ago 29 minutes 31,164 views",
		"quote": "When i see a person with a platform like yours speaking the truth that its kinda hard to find nowadays its bring me joy. Thank you. You took the words out of my mouth"
	}, {
		"url": "_4LhcPp9Isw",
		"title": "Theyre admitting it now... another Rings of Power fail",
		"description": "Theyre admitting it now... another Rings of Power fail by Melonie Mac Go Boom 5 months ago 13 minutes, 34 seconds 16,947 views",
		"quote": "you send a powerful message with each and every one of your videos! Im still not Christian and I love your way of making those messages make sense to the real world. so many people are too wrapped up in their own nonsense to take the time to relate with reality."
	}, {
		"url": "yP1i7H1drcE",
		"title": "They Made Lara Croft Ugly on Purpose",
		"description": "They Made Lara Croft Ugly on Purpose by Melonie Mac Go Boom 5 months ago 11 minutes, 32 seconds 21,871 views",
		"quote": "melonie  you keep being real. who wants to be part of a community that allows this type of bs to continue. Ill continue to support you 100 ."
	}, {
		"url": "Tp3yDEQkfCw",
		"title": "Rings of Power Fires Consultant for Calling Them Out",
		"description": "Rings of Power Fires Consultant for Calling Them Out by Melonie Mac Go Boom 5 months ago 11 minutes, 48 seconds 8,578 views",
		"quote": "monetize the disaster  melonie! well tune in for every new video. well make your bank account go boom."
	}, {
		"url": "SXjBhfUEb3s",
		"title": "Rippaverse Gives Us Hope Against the Woke Narrative",
		"description": "Rippaverse Gives Us Hope Against the Woke Narrative by Melonie Mac Go Boom 5 months ago 22 minutes 15,164 views",
		"quote": "I love how positive this community is"
	}, {
		"url": "N1R_g_0I3yA",
		"title": "Tomb Raider Movie Sequel Looks Unalived",
		"description": "Tomb Raider Movie Sequel Looks Unalived by Melonie Mac Go Boom 6 months ago 11 minutes, 23 seconds 13,981 views",
		"quote": "melonie mac can be lara crofts stunt double..."
	}, {
		"url": "-szeEkVIXT0",
		"title": "Welp She Hulk is Gonna Be M-She-U Trash",
		"description": "Welp She Hulk is Gonna Be M-She-U Trash by Melonie Mac Go Boom 6 months ago 11 minutes, 45 seconds 20,433 views",
		"quote": "why is she eating a stick of butter in the car  also melonie your looking beautiful as always"
	}, {
		"url": "XS6S6KoEjjU",
		"title": "Netflix is Ruining Death Note Again",
		"description": "Netflix is Ruining Death Note Again by Melonie Mac Go Boom 6 months ago 4 minutes, 21 seconds 6,852 views",
		"quote": "you can do whatever the heck you want. keep going boom  melonie!"
	}, {
		"url": "S7aj3Wz61Tg",
		"title": "Did Crystal Dynamics Sneakily Reveal the Next Lara Croft?",
		"description": "Did Crystal Dynamics Sneakily Reveal the Next Lara Croft? by Melonie Mac Go Boom 6 months ago 11 minutes, 55 seconds 8,189 views",
		"quote": "you are passionate about lara croft  not obsessed.also you only get a few great passions in your life  so definitely  fight  for your passion"
	}, {
		"url": "RUFfElWCr5A",
		"title": "Tomb Raider Needs Another Reboot or it Will Fail",
		"description": "Tomb Raider Needs Another Reboot or it Will Fail by Melonie Mac Go Boom 6 months ago 18 minutes 23,215 views",
		"quote": "melonies analysis of the tomb raider situation goes deep.  melonie knows her stuff. incredible video!"
	}, {
		"url": "pCcIi3hbjFk",
		"title": "Why is Joker 2 a Musical?",
		"description": "Why is Joker 2 a Musical? by Melonie Mac Go Boom 7 months ago 11 minutes, 34 seconds 6,921 views",
		"quote": "you know shes distraught when she skips the what is up my boomers!   intro. cant blame her  frankly."
	}, {
		"url": "wrnZe9GTQZM",
		"title": "Overwatchs Junker Queen is Underwhelming",
		"description": "Overwatchs Junker Queen is Underwhelming by Melonie Mac Go Boom 7 months ago 10 minutes, 6 seconds 9,604 views",
		"quote": "great video melonie. its very apparent that you put time and thought into this video. I always look forward to your videos. you keep us informed and entertained."
	}, {
		"url": "hgMUtqBun9o",
		"title": "Brad Pitt is Suing Angelina Jolie",
		"description": "Brad Pitt is Suing Angelina Jolie by Melonie Mac Go Boom 7 months ago 16 minutes 6,678 views",
		"quote": "you mean to say that even infamous tomboy melonie mac has a weakness  and its terrible movies wow"
	}, {
		"url": "8UR7Oyed4ts",
		"title": "Black Adam Trailer Reaction",
		"description": "Black Adam Trailer Reaction by Melonie Mac Go Boom 7 months ago 24 minutes 10,002 views",
		"quote": "just be a good person and I will watch what you got. good  bad  or ugly  Im here for it. since everything else is terrible politically correctness"
	}, {
		"url": "OSf_NoFds30",
		"title": "Prey Predator Prequel Trailer Reaction",
		"description": "Prey Predator Prequel Trailer Reaction by Melonie Mac Go Boom 7 months ago 15 minutes 11,005 views",
		"quote": "Its not that guys just like to watch girls. As youre basically the only female creator I watch. Its a multifaceted thing. Youre honest (atleast appear to be, idk you personally), youre attractive, youre based, and you seem like one of the guys"
	}, {
		"url": "LJ7AajUOUPc",
		"title": "Amber Heard Completely Cut from Aquaman 2?",
		"description": "Amber Heard Completely Cut from Aquaman 2? by Melonie Mac Go Boom 7 months ago 14 minutes, 28 seconds 5,527 views",
		"quote": "Mashing X to doubt, theres no way youre that old."
	}, {
		"url": "AKdM4Wzy6aE",
		"title": "Did Street Fighter 6 Go Woke?",
		"description": "Did Street Fighter 6 Go Woke? by Melonie Mac Go Boom 7 months ago 21 minutes 11,844 views",
		"quote": "Im going back to celebrating the old things I love and  melonie  you have my solemn vow... I will forever go boom!"
	}, {
		"url": "2YOFIL5_1lM",
		"title": "Warrior Galadriel Looks Ridiculous - Rings of Power",
		"description": "Warrior Galadriel Looks Ridiculous - Rings of Power by Melonie Mac Go Boom 7 months ago 22 minutes 10,106 views",
		"quote": "love your videos meloniemac!  I especially appreciate the verse of the day and how you are bold to talk about your faith. keep doing what youre doing."
	}, {
		"url": "laaWUmxd0b0",
		"title": "Reacting to the Verdict: Johnny Depp vs Amber Heard Trial",
		"description": "Reacting to the Verdict: Johnny Depp vs Amber Heard Trial by Melonie Mac Go Boom 7 months ago 14 minutes, 24 seconds 8,377 views",
		"quote": "love your videos  always encouraging. keep it up. and melonie  like always  Im still praying for you. have a good day."
	}, {
		"url": "3UBnZhDoUdo",
		"title": "Star Wars is Calling Fans Racist Again",
		"description": "Star Wars is Calling Fans Racist Again by Melonie Mac Go Boom 7 months ago 35 minutes 8,914 views",
		"quote": "love your accurate carnivore information."
	}, {
		"url": "ueRlTGWyZk0",
		"title": "Veganism is a Scam",
		"description": "Veganism is a Scam by Melonie Mac Go Boom 7 months ago 47 minutes 18,237 views",
		"quote": "Im down for horror stories and real life lessons with melonie mac any day"
	}, {
		"url": "jvpnFk42Hr4",
		"title": "Apparently Theres a Social Fat Spectrum Now",
		"description": "Apparently Theres a Social Fat Spectrum Now by Melonie Mac Go Boom 7 months ago 39 minutes 14,387 views",
		"quote": "Ive lost 26 ibs in one month. thank you melonie always for your encouragement and reassurance!"
	}, {
		"url": "pIzr0BCJH8M",
		"title": "The Double Standard is Real",
		"description": "The Double Standard is Real by Melonie Mac Go Boom 7 months ago 24 minutes 23,678 views",
		"quote": "agreed with you so much in this vid that my head almost fell off."
	}, {
		"url": "HSU94U3If6o",
		"title": "Batwoman Star Says She Will Be the Next Lara Croft",
		"description": "Batwoman Star Says She Will Be the Next Lara Croft by Melonie Mac Go Boom 7 months ago 21 minutes 12,190 views",
		"quote": "preach the good word  melonie  about the faith and against the vegan cultists."
	}, {
		"url": "WcfYh5suE2M",
		"title": "Halo is Now the Most Butchered Fandom Ever",
		"description": "Halo is Now the Most Butchered Fandom Ever by Melonie Mac Go Boom 7 months ago 21 minutes 7,491 views",
		"quote": "with how melonie feels about tomb raider  is how I feel about star wars! so I understand melonies frustration with her favorite property being so mismanaged."
	}, {
		"url": "8tV50d-goow",
		"title": "Tomb Raider Remasters Finally Happening?!",
		"description": "Tomb Raider Remasters Finally Happening?! by Melonie Mac Go Boom 7 months ago 16 minutes 8,693 views",
		"quote": "the fact melonie has been banned in tomb raider fan groups makes me more proud of her lmfaoo"
	}, {
		"url": "vxx9dPtHl0E",
		"title": "She Hulk Attorney at Law Trailer Reaction",
		"description": "She Hulk Attorney at Law Trailer Reaction by Melonie Mac Go Boom 7 months ago 16 minutes 10,158 views",
		"quote": "one thing I really enjoy about your channel melonie is you are very fair about things. you didnt just hate on this. good on you."
	}, {
		"url": "Ai7oIVzJuQ8",
		"title": "Amber Heards Mera Role Cut Down by WB",
		"description": "Amber Heards Mera Role Cut Down by WB by Melonie Mac Go Boom 7 months ago 18 minutes 6,625 views",
		"quote": "mac is back! my daily cardio wasnt the same without your videos."
	}, {
		"url": "D6tCF9LnIP0",
		"title": "Q and A Time!",
		"description": "Q and A Time! by Melonie Mac Go Boom 8 months ago 31 minutes 19,892 views",
		"quote": "horrors of keto  but it is working for me. Ive dropped close to 50 pounds since melonies video. Thanks!"
	}, {
		"url": "RrO1CmqdnWs",
		"title": "NY Post Says Trump Encouraged Musk to Buy Twitter",
		"description": "NY Post Says Trump Encouraged Musk to Buy Twitter by Melonie Mac Go Boom 8 months ago 30 minutes 4,124 views",
		"quote": "without context you saying  corn  is ruining people is the funniest thing ever. great videos  love when you share Bible verses."
	}, {
		"url": "waJDjAARRJE",
		"title": "The Reboot Tomb Raider Games Did NOT Sell Well",
		"description": "The Reboot Tomb Raider Games Did NOT Sell Well by Melonie Mac Go Boom 8 months ago 27 minutes 9,959 views",
		"quote": "melonie is one of those rare people that makes you a little happier just knowing that they exist"
	}, {
		"url": "ax1sUKY6Cmk",
		"title": "Florida Cops Open Fire on Pokemon Card Shoplifters",
		"description": "Florida Cops Open Fire on Pokemon Card Shoplifters by Melonie Mac Go Boom 8 months ago 16 minutes 5,339 views",
		"quote": "oh melonie  youre going to get me to act up with some dark humor.it is sad  but this lessens the sting."
	}, {
		"url": "5HSnu1YDvsw",
		"title": "Idiot Attempts to Rob a Concealed Carry Class",
		"description": "Idiot Attempts to Rob a Concealed Carry Class by Melonie Mac Go Boom 8 months ago 27 minutes 7,482 views",
		"quote": "I love watching these videos. good info and cute host. I hope I dont get diabetes consuming daily eye candy."
	}, {
		"url": "DIxLiuSiHAg",
		"title": "Square Enix Sells Tomb Raider",
		"description": "Square Enix Sells Tomb Raider by Melonie Mac Go Boom 8 months ago 17 minutes 11,164 views",
		"quote": "hey melonie I love your content so much! you have such an amazing head on your shoulders. "
	}, {
		"url": "k-xahmPQINg",
		"title": "Dead By Daylight Shoehorns Gay Character for Woke Points",
		"description": "Dead By Daylight Shoehorns Gay Character for Woke Points by Melonie Mac Go Boom 8 months ago 18 minutes 7,460 views",
		"quote": "anyone ever see those older videos of melonie from about 12 years ago  long before she went carnivore  she seems so much stronger and more vibrant now. shes like steve rogers after he got injected with the super soldier serum"
	}, {
		"url": "NgSC4mQ8zH0",
		"title": "Woman Marries Cat to Escape Eviction",
		"description": "Woman Marries Cat to Escape Eviction by Melonie Mac Go Boom 8 months ago 24 minutes 5,124 views",
		"quote": "you give me hope though God bless you man strength is key in life  good video !"
	}, {
		"url": "gVSMl_zJwEA",
		"title": "James Gunn Defends Chris Pratt Against Cancel Mob",
		"description": "James Gunn Defends Chris Pratt Against Cancel Mob by Melonie Mac Go Boom 8 months ago 19 minutes 5,318 views",
		"quote": "hooray for gfuel renewing their sponsorship with you  melonie! Ive never bought their products before  but Ill definitely be purchasing some now."
	}, {
		"url": "ftmkeD2G214",
		"title": "Resident Evil 4 VR Censors Sexist Content",
		"description": "Resident Evil 4 VR Censors Sexist Content by Melonie Mac Go Boom 8 months ago 29 minutes 7,166 views",
		"quote": "hey melonie  I wanna let you know that I recently prayed for the first time in ages. and I think you   your channel was influential to that."
	}, {
		"url": "2ZbcQrv6h4A",
		"title": "Robert Downey Jrs Vegan Diet Aint Working",
		"description": "Robert Downey Jrs Vegan Diet Aint Working by Melonie Mac Go Boom 8 months ago 29 minutes 13,250 views",
		"quote": "I just want to say  thanks melonie for actually keeping it real and just speaking your mind. feels like everyone these days just hops on the groupthink and cant actually make any solid logical arguments from their own perspectives. love the content  keep it up!"
	}, {
		"url": "DeS0TrbOcUk",
		"title": "Idiots Get STDs from Lizard?",
		"description": "Idiots Get STDs from Lizard? by Melonie Mac Go Boom 8 months ago 18 minutes 8,084 views",
		"quote": "melonie  thank you for your verses of the day and for your prayer group. Im an atheist on a bad day and an agnostic theist on a good day  but something compelled me to go to your prayer group. I had a wonderful experience and would love to tell you about it someday as it was incredible. your community was wonderful and welcoming and I will definitely be back next week."
	}, {
		"url": "TQOUKL8dbsI",
		"title": "Amber Heard Lies Exposed by Makeup Brand",
		"description": "Amber Heard Lies Exposed by Makeup Brand by Melonie Mac Go Boom 8 months ago 18 minutes 11,001 views",
		"quote": "thanks for providing a positive environment on the internet. love the positive lifestyle. thank you for the entertainment. wishing you mech success."
	}, {
		"url": "Z1yEWM6JtsA",
		"title": "Guy Sues Streamer Girl for not Falling in Love with Him",
		"description": "Guy Sues Streamer Girl for not Falling in Love with Him by Melonie Mac Go Boom 8 months ago 17 minutes 12,282 views",
		"quote": "I could listen to your thoughts on life all day. thanks for the content melonie Im really enjoying your insight. perhaps I ll consider donating to you  with no expectations of course"
	}, {
		"url": "0ceqkDyhJ0A",
		"title": "Uncancellable Abusers in Hollywood",
		"description": "Uncancellable Abusers in Hollywood by Melonie Mac Go Boom 8 months ago 30 minutes 14,216 views",
		"quote": "hey melonie  just wanted to say thanks for all the great content! this channel has been dope."
	}, {
		"url": "Bqm8hAFBWMw",
		"title": "GTAV Remaster Removed Alleged Transphobic Content",
		"description": "GTAV Remaster Removed Alleged Transphobic Content by Melonie Mac Go Boom 8 months ago 26 minutes 8,672 views",
		"quote": "and on another note  joshua 1:9 was exactly the verse I needed to hear today  so thank you and keep up Gods work"
	}, {
		"url": "Cl4iY4uxJV4",
		"title": "The Woke Mob is Trying to Cancel Chris Pratt Again",
		"description": "The Woke Mob is Trying to Cancel Chris Pratt Again by Melonie Mac Go Boom 8 months ago 27 minutes 12,141 views",
		"quote": "you are an amazing person melonie. keep fighting the good fight. were right behind ya. btw  hair looks great."
	}, {
		"url": "LoAKBQpD8hI",
		"title": "Thor Love and Thunder Trailer Reaction",
		"description": "Thor Love and Thunder Trailer Reaction by Melonie Mac Go Boom 8 months ago 26 minutes 15,018 views",
		"quote": "melonie to make a short video of her grilling a 96 ounce steak and then eating it just to make the militant vegans lose their f-ing minds."
	}, {
		"url": "XsHUsZmSLl4",
		"title": "Pedro Pascal Didnt Study for His Role for Joel in The Last of Us",
		"description": "Pedro Pascal Didnt Study for His Role for Joel in The Last of Us by Melonie Mac Go Boom 9 months ago 22 minutes 6,403 views",
		"quote": "this girl is feisty and owns her opinions without backing down. as the joker put it  there is some fight in you  I like that!  I love melonies personality."
	}, {
		"url": "mYK1ZnnnEQ0",
		"title": "Elon Musk Buying Twitter for Free Speech?",
		"description": "Elon Musk Buying Twitter for Free Speech? by Melonie Mac Go Boom 9 months ago 19 minutes 7,698 views",
		"quote": "I could watch listen to melanie read me the cheesecake factory menu"
	}, {
		"url": "ImlsxUEbaIk",
		"title": "Activision Blizzard to Hire More Women Plus Political Scandal",
		"description": "Activision Blizzard to Hire More Women Plus Political Scandal by Melonie Mac Go Boom 9 months ago 25 minutes 8,455 views",
		"quote": "keep up the good fight. I admire your earnest sincerity and your faith. unfortunately  the creative industries have been hijacked by spiritually empty people  deeply unhappy with their lives and lashing out because they dont know how to fix them."
	}, {
		"url": "G_2EJ08VteA",
		"title": "TMNT Comics Made April ONeil Uglier",
		"description": "TMNT Comics Made April ONeil Uglier by Melonie Mac Go Boom 9 months ago 19 minutes 16,708 views",
		"quote": "I so enjoy melonies rants!"
	}, {
		"url": "SKI-dNM2fbc",
		"title": "Brie Larson Joins Fast & Furious 10",
		"description": "Brie Larson Joins Fast & Furious 10 by Melonie Mac Go Boom 9 months ago 19 minutes 8,539 views",
		"quote": "gotta admit. melonie is the biggest tomb raider fan I have found on youtube."
	}, {
		"url": "Y943LTwdgDQ",
		"title": "Chrono Cross Remaster Censorship",
		"description": "Chrono Cross Remaster Censorship by Melonie Mac Go Boom 9 months ago 19 minutes 12,991 views",
		"quote": "melonie is based"
	}, {
		"url": "O3-fQICf4pQ",
		"title": "Gaming Journos Want Lara Croft to be Lesbian",
		"description": "Gaming Journos Want Lara Croft to be Lesbian by Melonie Mac Go Boom 9 months ago 21 minutes 14,398 views",
		"quote": "I love your content  melonie! it took courage to start speaking your mind publicly even though doing so could have alienated your established followers. I also really love the daily scripture verses. keep it up"
	}, {
		"url": "HT_vBLHaavs",
		"title": "Based Batman Writer says Rings of Power is an Abomination",
		"description": "Based Batman Writer says Rings of Power is an Abomination by Melonie Mac Go Boom 9 months ago 19 minutes 11,273 views",
		"quote": "going off on rings of power while repping rainbow brite. respect  melonie!"
	}, {
		"url": "A6ytC5C6EkY",
		"title": "New Tomb Raider Game Officially Announced 2022",
		"description": "New Tomb Raider Game Officially Announced 2022 by Melonie Mac Go Boom 9 months ago 29 minutes 26,003 views",
		"quote": "you are an honest delight melonie because you keep it real with you own distinct personality  you upload insightful and entertaining videos daily  and you have a great connection with your subscribers "
	}, {
		"url": "aGfvxFuAlaE",
		"title": "Why Morbius Was So Bad",
		"description": "Why Morbius Was So Bad by Melonie Mac Go Boom 9 months ago 28 minutes 11,260 views",
		"quote": "hey melonie  this was a really good review. you obviously understand storytelling very well  because your solutions to the problem sound like theyd work wonderfully!"
	}, {
		"url": "u2HeVH_YTrQ",
		"title": "White Woman Gaming Journo Hating on White Men Again",
		"description": "White Woman Gaming Journo Hating on White Men Again by Melonie Mac Go Boom 9 months ago 13 minutes, 46 seconds 14,463 views",
		"quote": "just found this channel. love it ! keep it up girl. melonie mac a regular ray of sunshine   positivity in your life ."
	}, {
		"url": "aDizTkivE04",
		"title": "LOTR Fansite Dying on the Rings of Power Hill",
		"description": "LOTR Fansite Dying on the Rings of Power Hill by Melonie Mac Go Boom 9 months ago 21 minutes 13,339 views",
		"quote": "hey melonie  recent subscriber here!  caught you on friday night tights!  to my surprise  youre not only beautiful but a gamer with values Christian !  also  youre a carnivore!"
	}, {
		"url": "dEKJUqdRBxw",
		"title": "Anita Sarkeesian Says Feminism Has Won in Gaming",
		"description": "Anita Sarkeesian Says Feminism Has Won in Gaming by Melonie Mac Go Boom 9 months ago 16 minutes 24,014 views",
		"quote": "love your content on games  movies and pop culture. I also appreciate the spiritual aspect without beating people over the head with it . keep up the good work. subscribers 100k on the way!"
	}, {
		"url": "heg8rtKOtEc",
		"title": "Ron Perlman Woke Twitter Meltdown",
		"description": "Ron Perlman Woke Twitter Meltdown by Melonie Mac Go Boom 9 months ago 10 minutes, 50 seconds 6,600 views",
		"quote": "melonie  you are a breath of fresh air.  thank you for the Bible verses.  as someone who has been struggling with his fellow Christians over the past few months  its nice to see just some good  old-fashioned  straightforward affirmations."
	}, {
		"url": "O1JRvhCleyQ",
		"title": "She Hulk Supposedly Looks Like Trash",
		"description": "She Hulk Supposedly Looks Like Trash by Melonie Mac Go Boom 9 months ago 14 minutes, 19 seconds 11,529 views",
		"quote": "melonie mac totally based and one of the g o a t  youtubers as far as I am concerned"
	}, {
		"url": "NtPj-qSD4ac",
		"title": "Will Smith vs Chris Rock Slap Gate - Was it Real?",
		"description": "Will Smith vs Chris Rock Slap Gate - Was it Real? by Melonie Mac Go Boom 9 months ago 14 minutes, 35 seconds 7,391 views",
		"quote": "yall believe the will smith slap was real. I believe in bigfoot. were not the same.  - melonie mac. go boom right there."
	}, {
		"url": "JeDzUxtXtKo",
		"title": "Game Journos Not Happy with Representation Again in Ghostwire Tokyo Review",
		"description": "Game Journos Not Happy with Representation Again in Ghostwire Tokyo Review by Melonie Mac Go Boom 9 months ago 14 minutes, 59 seconds 9,866 views",
		"quote": "hey melonie  love your videos. Im a bit of a sissy and mostly play videogames on normal mode. your coverage regarding difficulty in games have finally pushed me to try and play awakening on hard and classic."
	}, {
		"url": "RowpDyy7DXs",
		"title": "Hayley Atwell as Lara Croft, Jujutsu Kaisen, and FnT. Answering Comments",
		"description": "Hayley Atwell as Lara Croft, Jujutsu Kaisen, and FnT. Answering Comments by Melonie Mac Go Boom 9 months ago 19 minutes 10,186 views",
		"quote": "melonie mac  goin boom  right out of the mouths of haters. keep up the amazing work"
	}, {
		"url": "tf3s-WdCJUQ",
		"title": "Nicolas Cage Disses Disney",
		"description": "Nicolas Cage Disses Disney by Melonie Mac Go Boom 9 months ago 16 minutes 9,508 views",
		"quote": "literally saving my life and such an easy way to eat and get healthy!     you got a new sub!"
	}, {
		"url": "FzDv3XVYJDg",
		"title": "Reacting to the New Moon Knight Clip",
		"description": "Reacting to the New Moon Knight Clip by Melonie Mac Go Boom 9 months ago 16 minutes 6,743 views",
		"quote": "melonie and brittany have a 10 minute segment in the video she mentioned  where they talk about a moba. its the best. thing. ever."
	}, {
		"url": "F-Pssa_Rv0s",
		"title": "Andrew Garfield Says Straight Actors Should Have Opportunity to Play Gay Roles",
		"description": "Andrew Garfield Says Straight Actors Should Have Opportunity to Play Gay Roles by Melonie Mac Go Boom 9 months ago 10 minutes, 37 seconds 7,000 views",
		"quote": "you like drawing  youre a legit gamer  and a Christian   its like youre a shorter  brown-haired  brown-eyed  female version of me  almost."
	}, {
		"url": "iRE691wxQxs",
		"title": "Blair Herter Leaves G4 - Is this the End?",
		"description": "Blair Herter Leaves G4 - Is this the End? by Melonie Mac Go Boom 9 months ago 22 minutes 9,016 views",
		"quote": "youre like the jessica chobot to my 9 year olds little melonie mac... she loves watching and likes the verses"
	}, {
		"url": "hmobr-gB5w0",
		"title": "Using GIFS is Digital Blackface Now Apparently",
		"description": "Using GIFS is Digital Blackface Now Apparently by Melonie Mac Go Boom 9 months ago 12 minutes, 41 seconds 10,053 views",
		"quote": "just wanted to say hi! I am not a Christian  but I enjoy your verse of the day. learning a word of God cannot be a bad thing in this world. keep up the great videos and go boom!"
	}, {
		"url": "KeNe1WFZGzk",
		"title": "Halo TV Series Doesnt Care About the Games",
		"description": "Halo TV Series Doesnt Care About the Games by Melonie Mac Go Boom 9 months ago 16 minutes 12,597 views",
		"quote": "hI melonie I am relatively new here  a couple of videos in now  and I have to say I like your channel more with every video."
	}, {
		"url": "gcD2pxbnAtA",
		"title": "Instagram Scolded Me for Wearing This",
		"description": "Instagram Scolded Me for Wearing This by Melonie Mac Go Boom 9 months ago 14 minutes, 27 seconds 29,299 views",
		"quote": "facebook   instagram: calling russians bad is ok. melonie:  pinch me and I ll punch you. facebook   instagram:  hold up there."
	}, {
		"url": "1HVXHQgIDs0",
		"title": "Tomb Raider Kingdom PSOne Fan Project",
		"description": "Tomb Raider Kingdom PSOne Fan Project by Melonie Mac Go Boom 9 months ago 19 minutes 7,614 views",
		"quote": "the game looks great! I love seeing you nerd out and fan girl over things  especially over classic tomb raider because you grin from ear to ear."
	}, {
		"url": "nq8sA3qcWBI",
		"title": "Ms Marvel Trailer Reaction",
		"description": "Ms Marvel Trailer Reaction by Melonie Mac Go Boom 10 months ago 19 minutes 16,852 views",
		"quote": "anybody else thinks melonie calling us boomers is kinda... hardcore in a cute way   I mean every single time I picture every viewer after hearing  whats up my boomers    emitting a low  deep and guttural booooooom whether they re watching their screens or listening while doing something else  like the gow boomer ennemy does when engaged in combat. and thats just great!"
	}, {
		"url": "iVDxOz1pvqk",
		"title": "Red Sonja Reboot Gets New Actress and Director?",
		"description": "Red Sonja Reboot Gets New Actress and Director? by Melonie Mac Go Boom 10 months ago 14 minutes, 17 seconds 13,009 views",
		"quote": "melonie I happened across your channel by accident and I think its awesome that you do a Bible verse of the day. Im an old fart and you give me hope that the wokies aren t going to win.  stay true to your faith."
	}, {
		"url": "ZuTHVmoFwvI",
		"title": "Wokies Cancel Anime Girl for Having a Tan",
		"description": "Wokies Cancel Anime Girl for Having a Tan by Melonie Mac Go Boom 10 months ago 17 minutes 20,232 views",
		"quote": "your in my top 5 favorites  great job."
	}, {
		"url": "20bTnXhWNjM",
		"title": "Is Perfect Dark Going Woke?",
		"description": "Is Perfect Dark Going Woke? by Melonie Mac Go Boom 10 months ago 22 minutes 10,970 views",
		"quote": "Im a gen xer  and I normally hate being mistaken for a boomer. but on this channel  my wife and I feel like its meant as a term of endearment."
	}, {
		"url": "QD0rXrNOkqU",
		"title": "Haters Trying to Cancel Me Again with Fake Tweets",
		"description": "Haters Trying to Cancel Me Again with Fake Tweets by Melonie Mac Go Boom 10 months ago 20 minutes 19,292 views",
		"quote": "if they re going to these extra length to try and stop you  that means they are scared of you continue being strong  melonie never bend the knee to these crazies ignore the haters  melonie. youre awesome. keep up the great work."
	}, {
		"url": "_rGmbIH-Ilc",
		"title": "Most Modern Gaming Caters to the Participation Trophy Crowd",
		"description": "Most Modern Gaming Caters to the Participation Trophy Crowd by Melonie Mac Go Boom 10 months ago 34 minutes 14,425 views",
		"quote": "congrats melonie on 25k subs! I agree with you totally on bringing back the difficulty factors. those mind building puzzles are important for the younger crowd."
	}, {
		"url": "L78rYYeNvFE",
		"title": "Lost Ark Folds to the Mob - Still Not Enough For Them",
		"description": "Lost Ark Folds to the Mob - Still Not Enough For Them by Melonie Mac Go Boom 10 months ago 30 minutes 19,271 views",
		"quote": "I am a pastor  on my day off. I clicked the video  expecting an innocuous discussion of video game culture. then bam! you hit me with some really coherent and relevant biblical discussion. nicely handled  melanie. God bless you."
	}, {
		"url": "4DkU6pwAFSs",
		"title": "Elden Ring Didnt Fold to the Mob",
		"description": "Elden Ring Didnt Fold to the Mob by Melonie Mac Go Boom 10 months ago 28 minutes 15,209 views",
		"quote": "youre so refreshing to listen to...God bless you melonie"
	}, {
		"url": "O5d3sqK-4UY",
		"title": "GameSpot Talks About... Video Game Bra Sizes???",
		"description": "GameSpot Talks About... Video Game Bra Sizes??? by Melonie Mac Go Boom 10 months ago 21 minutes 25,489 views",
		"quote": "good to know melonie will always keep us abreast of such important topics."
	}, {
		"url": "6FxOaZB9WpU",
		"title": "Guys Dont Want to Game With Girls Any More",
		"description": "Guys Dont Want to Game With Girls Any More by Melonie Mac Go Boom 10 months ago 16 minutes 230,266 views",
		"quote": "this was unexpectedly solid melonie  your self-awareness and capacity to almost play mediator between both women and men on this matter was really solid."
	}, {
		"url": "cE_grwGrSBI",
		"title": "Phil Spencer Says Leave Gaming Devs Alone!",
		"description": "Phil Spencer Says Leave Gaming Devs Alone! by Melonie Mac Go Boom 10 months ago 15 minutes 7,706 views",
		"quote": "melonie  youre probably my new favorite youtuber. I have been watching you for a while  but this new channel is the ish! love to see the interaction with your subs  and the messages from the Bible!"
	}, {
		"url": "rrZHDcpJw_E",
		"title": "Stop Wussifying Westerns - The Power of the Dog",
		"description": "Stop Wussifying Westerns - The Power of the Dog by Melonie Mac Go Boom 10 months ago 23 minutes 16,698 views",
		"quote": "wow melonie  thats the understatement of the decade! take an upvote from me!"
	}, {
		"url": "-V3Q-uUT6Ww",
		"title": "New Rings of Power Leaks - Absolute Mess",
		"description": "New Rings of Power Leaks - Absolute Mess by Melonie Mac Go Boom 10 months ago 18 minutes 20,088 views",
		"quote": "I just discovered your channel and yes I binge watched all of your videos. Im glad you exist"
	}, {
		"url": "E9iM42yZNsk",
		"title": "Gaming Journos Go On Strike",
		"description": "Gaming Journos Go On Strike by Melonie Mac Go Boom 10 months ago 21 minutes 10,966 views",
		"quote": "hI melonie I seriously love how much you bring out all these interesting topics. take care melonie"
	}, {
		"url": "HhmX6n728ws",
		"title": "Charlize Theron Felt Threatened by Tom Hardy During Mad Max Fury Road Filming",
		"description": "Charlize Theron Felt Threatened by Tom Hardy During Mad Max Fury Road Filming by Melonie Mac Go Boom 10 months ago 21 minutes 11,409 views",
		"quote": "your videos are very organized. when you go on fright night tights you should mention to ryan that you could teach him out to be more organized  and mention how many tabs he keeps open on his browser is terrifying."
	}, {
		"url": "0bANCyJ-Nfw",
		"title": "Zoe Kravitz Snubs Tifa and Aerith from Final Fantasy VII",
		"description": "Zoe Kravitz Snubs Tifa and Aerith from Final Fantasy VII by Melonie Mac Go Boom 10 months ago 18 minutes 31,052 views",
		"quote": "melonie is like a cross between aerith and tifa. she has the kindness and spirituality of the former  and the fortitude  yet occasional vulnerability   vitality  and pretty  very feminine features of the latter."
	}, {
		"url": "tj857UcXM9w",
		"title": "Haters, Lara Croft, and Jesus - Answering Comments",
		"description": "Haters, Lara Croft, and Jesus - Answering Comments by Melonie Mac Go Boom 10 months ago 38 minutes 17,816 views",
		"quote": "melonie  Ive really been enjoying your takes on pop culture since the quartering blasted your channel out. thanks for being a rational  genuine and decent person."
	}, {
		"url": "uqOn9w-OrqY",
		"title": "Crystal Dynamics Slander Classic Lara Croft Again: Tomb Raider Exhibit",
		"description": "Crystal Dynamics Slander Classic Lara Croft Again: Tomb Raider Exhibit by Melonie Mac Go Boom 10 months ago 26 minutes 24,612 views",
		"quote": "thank you melonie  you speak for a lot of us"
	}, {
		"url": "5HOKoGDu1R0",
		"title": "Cringe Twitter Takes About Ukraine and Russia Conflict",
		"description": "Cringe Twitter Takes About Ukraine and Russia Conflict by Melonie Mac Go Boom 10 months ago 21 minutes 12,516 views",
		"quote": "I love it when melonie looks like she just stepped out the 90s"
	}, {
		"url": "z26T9lAcld0",
		"title": "Marvel Erases Femininity Again - Valkyrie in Thor Love and Thunder",
		"description": "Marvel Erases Femininity Again - Valkyrie in Thor Love and Thunder by Melonie Mac Go Boom 10 months ago 22 minutes 16,603 views",
		"quote": "I recommend your channel to my 16 year old daughter jordan she loves all your comic and anime content not to mention your positivity. also she loves how you are not afraid to declare your faith."
	}, {
		"url": "QJ8aKcNhrbM",
		"title": "Cara Cunningham SLAMS the Woke Cancel Mob",
		"description": "Cara Cunningham SLAMS the Woke Cancel Mob by Melonie Mac Go Boom 10 months ago 17 minutes 10,301 views",
		"quote": "Im glad I gave this channel a try. you are doing good work here  very positive.  keep it up"
	}, {
		"url": "y_SKFTYOmCg",
		"title": "Reacting to Libertarian Memes",
		"description": "Reacting to Libertarian Memes by Melonie Mac Go Boom 10 months ago 16 minutes 12,074 views",
		"quote": "can I just comment on how pleasant your laugh is  melonie"
	}, {
		"url": "gmPNQ-aQE4A",
		"title": "Fans Unwoke Lara Croft",
		"description": "Fans Unwoke Lara Croft by Melonie Mac Go Boom 10 months ago 28 minutes 87,552 views",
		"quote": "melonie mac go boom you always have awesome videos. keep at it too. glad you are doing amazing on this channel. I love tomb raider too. love lara croft. she is such a badass and facts. fans do it better"
	}, {
		"url": "y6CEcK9S7XA",
		"title": "Why We Need Misinformation",
		"description": "Why We Need Misinformation by Melonie Mac Go Boom 10 months ago 34 minutes 14,091 views",
		"quote": "melonie! p.s. your outro song is a banger! I always play the video to the very end for the song."
	}, {
		"url": "fepMqWFu51E",
		"title": "Amazon Fail Explaining Why Galadriel is a Warrior in Rings of Power",
		"description": "Amazon Fail Explaining Why Galadriel is a Warrior in Rings of Power by Melonie Mac Go Boom 10 months ago 12 minutes, 5 seconds 36,643 views",
		"quote": "melonie mac you really should use the proper title  the wrongs of power ..."
	}, {
		"url": "OYXR8RmMlt0",
		"title": "Horizon Forbidden West Accused of Native American Cultural Appropriation",
		"description": "Horizon Forbidden West Accused of Native American Cultural Appropriation by Melonie Mac Go Boom 10 months ago 21 minutes 12,149 views",
		"quote": "hello from the navajo nation  just wanted to say Ive been a fan for years now. keep up the great content melonie  youre my hero"
	}, {
		"url": "fgrVrkyXcrw",
		"title": "Unified Lara Croft Looks Like a Dude",
		"description": "Unified Lara Croft Looks Like a Dude by Melonie Mac Go Boom 11 months ago 23 minutes 31,990 views",
		"quote": "melanie mac - dont stop- go boom! use this platform as your heart dictates and you will make a difference for the better."
	}, {
		"url": "ThHol35nLQo",
		"title": "Kotaku is Scared of the Hot Women Again - Lost Ark",
		"description": "Kotaku is Scared of the Hot Women Again - Lost Ark by Melonie Mac Go Boom 11 months ago 19 minutes 17,153 views",
		"quote": "glad I found your channel  you crack me the hell up."
	}, {
		"url": "h2HsETaKrDw",
		"title": "Amazons Rings of Power Trailer Reaction! Dumpster Fire!",
		"description": "Amazons Rings of Power Trailer Reaction! Dumpster Fire! by Melonie Mac Go Boom 11 months ago 17 minutes 12,036 views",
		"quote": "youre an excellent communicator  melonie."
	}, {
		"url": "1WWxPyETp20",
		"title": "Woke Twitter Already Gaslighting Lord of the Rings Fans",
		"description": "Woke Twitter Already Gaslighting Lord of the Rings Fans by Melonie Mac Go Boom 11 months ago 18 minutes 17,245 views",
		"quote": "melonie. I am grateful that you ve been freed up to give your thoughts on the woke trends destroying our favourite stories  games and entertainment."
	}, {
		"url": "bx45DhmVbG4",
		"title": "The Problem with Puritan Culture on Both Sides",
		"description": "The Problem with Puritan Culture on Both Sides by Melonie Mac Go Boom 11 months ago 31 minutes 12,896 views",
		"quote": "this girl is one of the most based people Ive seen. constantly referring to the Bible for guidance and supporting statements and opinions. great job melonie  and thanks for being a role model."
	}, {
		"url": "Rkcx79FlkZc",
		"title": "Gina Caranos Terror on the Prairie Teaser Trailer Reaction",
		"description": "Gina Caranos Terror on the Prairie Teaser Trailer Reaction by Melonie Mac Go Boom 11 months ago 4 minutes, 49 seconds 8,223 views",
		"quote": "I like the short vids- each video should be length dictated by what its about - this was perfect - keep it up melonie- God bless"
	}, {
		"url": "3gQmgXBpefI",
		"title": "Amazons Lord of the Rings Looks Trash",
		"description": "Amazons Lord of the Rings Looks Trash by Melonie Mac Go Boom 11 months ago 21 minutes 25,653 views",
		"quote": "hey! your explanation of why pandering is so insulting was excellent!!"
	}, {
		"url": "9CuJRWd6jDw",
		"title": "Marvel Uglifies Artists Work Because Woke",
		"description": "Marvel Uglifies Artists Work Because Woke by Melonie Mac Go Boom 11 months ago 17 minutes 12,827 views",
		"quote": "love your art! wish I could draw."
	}, {
		"url": "N5Xg-M8lkkY",
		"title": "The Woke Mob Want to Dictate Every Facet of Your Life",
		"description": "The Woke Mob Want to Dictate Every Facet of Your Life by Melonie Mac Go Boom 11 months ago 23 minutes 23,344 views",
		"quote": "I keep telling myself all this insanity isnt sustainable.  seems more voices are being added on our side and looks like we have a good one in melonie."
	}, {
		"url": "n3Ooqc6cnbE",
		"title": "Content Creator Fired Over Tweeting Song Lyrics 11 Years Ago",
		"description": "Content Creator Fired Over Tweeting Song Lyrics 11 Years Ago by Melonie Mac Go Boom 11 months ago 18 minutes 19,881 views",
		"quote": "hey melonie! I saw the shoutout from jeremy of the quatering but I also remember you from back when you hosted gamestop tv! as a former gamestop employee who is also female of traditional Christian values I totally want to support your channel! you go girl!"
	}, {
		"url": "VWfSO8wIl48",
		"title": "Why I No Longer Host for GameStop TV",
		"description": "Why I No Longer Host for GameStop TV by Melonie Mac Go Boom 11 months ago 32 minutes 110,294 views",
		"quote": "melonie  youre really encouraging to listen to  especially when you bring up your faith. this is what we need is more content creators saying what they mean and being real  instead of putting on a fake mask to try and please others for the wrong reasons."
	}
]